{
  "export_timestamp": "2025-08-05T14:55:34.182662",
  "tables": {
    "users": {
      "count": 4,
      "data": [
        {
          "id": 7,
          "username": "test1234",
          "password_hash": "937e8d5fbb48bd4949536cd65b8d35c426b80d2f830c5c308e2cdec422ae2244",
          "email": "test1234@test.com",
          "created_at": "2025-05-23 11:26:23"
        },
        {
          "id": 8,
          "username": "renright007",
          "password_hash": "937e8d5fbb48bd4949536cd65b8d35c426b80d2f830c5c308e2cdec422ae2244",
          "email": "robert63.enright@gmail.com",
          "created_at": "2025-06-03 09:59:37"
        },
        {
          "id": 9,
          "username": "testuser1",
          "password_hash": "ef92b778bafe771e89245b89ecbc08a44a4e166c06659911881f383d4473e94f",
          "email": "test1@example.com",
          "created_at": "2025-07-22 09:02:19"
        },
        {
          "id": 10,
          "username": "testuser2",
          "password_hash": "c6ba91b90d922e159893f46c387e5dc1b3dc5c101a5a4522f03b987177a24a91",
          "email": "test2@example.com",
          "created_at": "2025-07-22 09:02:19"
        }
      ]
    },
    "jobs": {
      "count": 32,
      "data": [
        {
          "id": 1,
          "company_name": "OECD",
          "job_title": "Data Scientist",
          "job_description": "About the job\nCompany Description\n\nThe Organisation for Economic Co-operation and Development (OECD) is an international organisation comprised of 38 member countries, that works to build better policies for better lives. Our mission is to promote policies that will improve the economic and social well-being of people around the world. Together with governments, policy makers and citizens, we work on establishing evidence-based international standards, and finding solutions to a range of social, economic and environmental challenges. From improving economic performance and creating jobs to fostering strong education and fighting international tax evasion, we provide a unique forum and knowledge hub for data and analysis, exchange of experiences, best-practice sharing, and advice on public policies and international standard-setting.\n\nTHE EXECUTIVE DIRECTORATE (EXD)\n\nThe Executive Directorate (EXD) is the steward of OECD resources, on behalf of the Secretary-General. Our focus is on people and their wellbeing; the effective and efficient management of the budget; the safety and security of staff, Delegations, visitors, and of the OECD’s data; maintaining and sustaining physical and digital infrastructure; and enabling the convening power of the OECD through conferences, meetings and events, whether virtual, physical or hybrid. As well as providing corporate services, functions and management support to our staff and Members, we provide integrated, strategic and expert advice on corporate policies and management issues to the Secretary-General, to Council and to Standing Committees, to which we regularly report on corporate matters. We also provide risk management functions (for management areas under our purview). Ours is a fast-paced environment focused on delivering management excellence across all of our functions.\n\nTHE HUMAN RESOURCES MANAGEMENT SERVICE (EXD/HRM)\n\nWithin the OECD’s Executive Directorate (EXD), the Human Resource Management Service (HRM) is responsible for providing stewardship of the Organisation’s human capital on behalf of the Secretary-General. It is composed of three Divisions: HR Operations (HRO), Client Services (CSG) and Talent Management and Analytics (TMA). TMA develops, implements and supports a variety of human capital projects for the Organisation’s workforce. The division ensures that business processes and tools are adequate and provides data-driven solutions to help build diverse, inclusive and effective teams. TMA also manages the OECD’s learning and development initiatives and runs several programmes aimed at ensuring the OECD attracts outstanding talent from interns right up to senior managers.\n\nTHE POSITION\n\nEXD/HRM/TMA is seeking a motivated, experienced and detail-oriented Data Scientist to contribute to ongoing strategic projects, business intelligence and reporting efforts. The Data Scientist will report to the Analytics Lead and collaborate with various TMA teams to conduct data analysis, create dashboards and process data using advanced analytical techniques. This is an opportunity to support key corporate initiatives by transforming complex data into actionable insights that support decision making and the development of corporate policies and practices.\n\nJob Description\n\nMain Responsibilities\n\nResearch and Analysis\n\nDesign, develop and maintain innovative digital solutions (dashboards, data visualisations, models, etc.) to address key management questions.\nCollect, clean, compile and analyse HR and financial data to generate actionable insights.\nStay up to date with emerging trends and conduct research to explore innovative technologies and solutions.\nLeverage data to identify process improvements and provide data-driven recommendations.\n\nProjects and Co-ordination\n\nCollaborate across HRM including Strategic Projects and HR Information Systems on the development and implementation of the Organisation’s Strategic Workforce Planning efforts, including technical development, providing advice and ensuring reporting and analytics requirements align with business and user needs.\nWork closely with stakeholders across the Organisation to translate business requirements into user-friendly products while co-ordinating testing and implementation.\nDefine key metrics and performance indicators in line with core strategic projects.\nSupport other TMA projects and initiatives as required.\n\nCommunication and Training\n\nCreate communication materials and reports to present complex analyses in a clear and impactful manner for non-technical audiences.\nDeliver capacity building sessions to help end users understand and use analytics products effectively.\nSupport stakeholders by gathering, analysing and presenting data to help inform communications and decisions with clear, evidence-based insights.\nDeliver capacity-building webinars and workshops to different audiences.\n\nDeliver regular and ad hoc briefings, reports, updates and presentations to management and clients.\n\nQualifications\n\nIdeal Candidate Profile\n\nAcademic Background\n\nAdvanced university degree in business analytics, data science, information management, human resources or related field.\n\nProfessional Background\n\nA minimum of 3 years of relevant work experience.\nDemonstrated intellectual and analytical rigour evaluate complex issues and provide solutions.\nExperience in conducting research and analysis of organisational development issues using quantitative and qualitative data.\nStrong communication skills with the ability to articulate and present key findings with high impact, including to a variety of non-expert audiences to drive change and stakeholder engagement.\nUnderstanding of HR policies and programmes is an asset.\n\nTools and Technical skills\n\nExperience in Data management, Data analysis, Business Process Improvement, Analytics tools.\nProficiency in query and programming languages, such as SQL, Python including dash and R, other programming languages would be a plus.\nHands-on experience with data visualisation and analysis tools (e.g. Power BI, Business Intelligence and reporting technology, etc.).\nExperience with HR Information Systems is an advantage.\n\nLanguages\n\nFluency in one of the two OECD official languages (English and French) and a knowledge of, or a willingness to learn, the other.\n\nCore Competencies\n\nVision and Strategy (Level 1), Enable People (Level 2), Ethics and Integrity (Level 2), Collaboration and Horizontality (Level 2), Achieve Results (Level 1), Innovate and Embrace Change (Level 2).\nPlease refer to the OECD Core Competency Framework.\n\nAdditional Information\n\nClosing Date\n\nThe incumbent would be expected to start their first working day no earlier than 01/07/2025, and the deadline for applications should reach us no later than 23h59 04 May 2025 (Paris time).\n\nContract Duration\n\nOpen-ended appointment, with no foreseen end date.\n\nWhat The OECD Offers\n\nDepending on level of experience, monthly salary starts at 5902.14 EUR, plus allowances based on eligibility, exempt of French income tax.\n\nClick here to consult the Staff Regulations applicable to officials of the OECD. Please note that from 1 July 2025, all Official appointments will be made under the OECD’s new contractual modalities.\nClick here to learn more about what we offer and why the OECD is a great place to work. \nClick here to browse our People Management Guidebook and learn more about all aspects relating to people at the OECD, our workplace environment and many other policies supporting staff in their daily life.\nPlease note that the appointment may be made at one grade lower in the specified job family, based on the qualifications and professional experience of the selected applicant.\nThis vacancy may be used to create a pool of candidates for comparable positions, both for open-ended and fixed-term functions. \n\nSelection Process\n\nFor retained candidates, the selection process may include a video-recorded interview, job-based assessment and panel interviews.\n\nThe OECD is an equal opportunity employer and welcomes the applications of all qualified candidates [who are nationals of OECD member countries], irrespective of their racial or ethnic origin, opinions or beliefs, gender, sexual orientation, health or disabilities.\n\nThe OECD promotes an optimal use of resources in order to improve its efficiency and effectiveness. Staff members are encouraged to actively contribute to this goal.",
          "application_url": "https://www.linkedin.com/jobs/view/4206836271/?refId=vUzmKZa5Q%2FGmtT%2FlROZ7sw%3D%3D&trackingId=cMsGjE4rRtmalo9yxBgTcw%3D%3D",
          "status": "Not Applied",
          "sentiment": "Positive",
          "notes": "Dream to work with the EU, not pay tax and live in Paris.",
          "date_added": "2025-05-03 17:46:59",
          "location": "Paris, France",
          "salary": "150000",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 2,
          "company_name": "Figma",
          "job_title": "Data Scientist",
          "job_description": "Figma is growing our team of passionate people on a mission to make design accessible to all. Born on the Web, Figma helps entire product teams brainstorm, design and build better products — from start to finish. Whether it’s consolidating tools, simplifying workflows, or collaborating across teams and time zones, Figma makes the design process faster, more efficient, and fun while keeping everyone on the same page. From great products to long-lasting companies, we believe that nothing great is made alone—come make with us!\n\nFigma is adding to our team of passionate people who are revolutionizing the world of design. We are building a browser-based design tool that looks and feels as good as a native application and has all the additional power and advantages that come from being built upon the web platform. If you’re looking to work at a dynamic company who is building the future of design tools, welcome to Figma.\n \nThis is a full-time role that can be based in one of our US hubs or remotely within the United States.\n \n \nWhat You'll Do:\nCollaborate cross-functionally to understand existing problems and identify areas of impact for your team\nUnderstand user behavior within Figma through creation of new datasets, metrics, experimentation, etc and guide decision making\nDevelop new techniques, datasets, tools that will enable answering previously unanswered questions and increasing rigor of analyses\nDesign and maintain frameworks that are widely leveraged across the company\nEstablish partnerships with cross-functional teams including Engineering, Product, Research, Design, Sales, and Marketing\nWe’d love to hear from you if you have:\n10+ years relevant work experience in Analytics, Data Science or Software Engineering\nFluency in SQL\nProficiency in Python, R, or a similar scripting language\nExperience in distributed data processing systems and framework (Hive, Redshift, Presto, Snowflake, Spark, etc)\nFirm knowledge of statistical methods and experimental design \nExcellent judgment and creative problem solving skills\nA self-starting mindset along with strong communication and collaboration skills\nRead more about our team:\nhttps://www.figma.com/blog/cross-functional-data-science-user-research-figma/\nhttps://www.figma.com/blog/how-we-use-data/\nhttps://www.figma.com/blog/from-experiment-to-launch-how-data-shaped-a-new-comments-experience/\nAt Figma, one of our values is Grow as you go. We believe in hiring smart, curious people who are excited to learn and develop their skills. If you’re excited about this role but your past experience doesn’t align perfectly with the points outlined in the job description, we encourage you to apply anyways. You may be just the right candidate for this or other roles.\nPay Transparency Disclosure\n\nIf based in Figma’s San Francisco or New York hub offices, this role has the annual base salary range stated below.    \n\nJob level and actual compensation will be decided based on factors including, but not limited to, individual qualifications objectively assessed during the interview process (including skills and prior relevant experience, potential impact, and scope of role), market demands, and specific work location. The listed range is a guideline, and the range for this role may be modified. For roles that are available to be filled remotely, the pay range is localized according to employee work location by a factor of between 80% and 100% of range. Please discuss your specific work location with your recruiter for more information. \n\nFigma offers equity to employees, as well a competitive package of additional benefits, including health, dental & vision, retirement with company contribution, parental leave & reproductive or family planning support, mental health & wellness benefits, generous PTO, company recharge days, a learning & development stipend, a work from home stipend, and cell phone reimbursement.  Figma also offers sales incentive pay for most sales roles and an annual bonus plan for eligible non-sales roles. Figma’s compensation and benefits are subject to change and may be modified in the future.\n\nAnnual Base Salary Range (SF/NY Hub):\n\n$164,000 - $338,000 USD\n\nAt Figma we celebrate and support our differences. We know employing a team rich in diverse thoughts, experiences, and opinions allows our employees, our product and our community to flourish. Figma is an equal opportunity workplace - we are dedicated to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity/expression, veteran status, or any other characteristic protected by law. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.\n\nWe will work to ensure individuals with disabilities are provided reasonable accommodation to apply for a role, participate in the interview process, perform essential job functions, and receive other benefits and privileges of employment. If you require accommodation, please reach out to accommodations-ext@figma.com. These modifications enable an individual with a disability to have an equal opportunity not only to get a job, but successfully perform their job tasks to the same extent as people without disabilities. \n\nExamples of accommodations include but are not limited to: \n\nHolding interviews in an accessible location\nEnabling closed captioning on video conferencing\nEnsuring all written communication be compatible with screen readers\nChanging the mode or format of interviews \nTo ensure the integrity of our hiring process and facilitate a more personal connection, we require all candidates keep their cameras on during video interviews. Additionally, if hired you will be required to attend in person onboarding.\n\nBy applying for this job, the candidate acknowledges and agrees that any personal data contained in their application or supporting materials will be processed in accordance with Figma's Candidate Privacy Notice.",
          "application_url": "https://job-boards.greenhouse.io/figma/jobs/5364867004?gh_jid=5364867004",
          "status": "Not Applied",
          "sentiment": "Negative",
          "notes": "Very interesting job in a great company. There are issues surrounding the location - I certainly do not want to live in the USA. It would be an incredible opportunity to learn and make great money, however I know I would not be happy living in the USA.\n\nLocation: San Francisco, CA | New York, NY",
          "date_added": "2025-05-05 15:37:18",
          "location": "San Francisco, USA",
          "salary": "200000",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 3,
          "company_name": "Glovo",
          "job_title": "Data Scientist",
          "job_description": "If you’re here, it’s because you’re looking for an exciting ride. A ride that will fuel up your ambitions to take on a new challenge and stretch yourself beyond your comfort zone. We’ll deliver a non-vanilla culture built on talent, where we work to amplify the impact on millions of people, paving the way forward together. Not your usual app. We are the fastest-growing multi-category app connecting millions of users with businesses, and couriers, offering on-demand services from more than 170,000 local restaurants, grocers and supermarkets, and high street retail stores. We operate in more than 1500 cities across 23 countries. Together we revolutionise the way people connect with their everyday needs, from delivering essentials to connecting our ecosystem of users through innovative solutions powered by technology. For us, every day is filled with purpose. What makes our ride unique? Our culture and strong values. Our career development philosophy. Our commitment to being a force for good. We have a vision: Building the largest marketplace in your city, to give access to anything in minutes. And this is where your ride starts. YOUR MISSION Support the development of logistics features, quantifying the impact that they might bring to the company, supporting the design process with data to make decisions, coordinating the rollout of features, and measuring their impact. THE JOURNEY Work closely with product and operations teams to define the product roadmap and strategy, monitor and give visibility of product metrics and KPIs. Apply data analytics and statistical techniques (e.g. A/B testing, multivariate testing, clustering) to uncover insights,validate product hypotheses and solve business problems that drive the highest impact. Translate product questions and hypotheses into structured analyses that drive clear, actionable outcomes Develop and maintain scalable and self-service visualization tools and storytelling dashboards. Owning everything analytics end to end in the product development cycle, from ideation and opportunity sizing, to experimentation and post-launch impact analyses. Define feature optimization strategies by analyzing usage patterns and tailoring recommendations for each geography. Build robust relationships with stakeholders acting as a strategic and supportive link between the technology, business and product. WHAT YOU WILL BRING TO THE RIDE 1-3 years of professional experience outside of an academic and internship setting, in a quantitative analysis role, preferably in product facing teams Knowledge or experience in digital product development Experience with an application of statistical modeling and advanced analytics to provide product-shaping insights Excellent SQL skills and experience applying those on-the-job; you know how to join multiple tables, you know how and when to use CTEs, and you use aggregate functions to come up with relevant statistics Solid proficiency in programming (Python/R) and experience working with popular tools such as Pandas, SciPy, Seaborn, Jupyter/iPython notebooks, R Markdown. Knowledgeable and preferably experienced in designing and analyzing experiments in digital products (A/B test, multivariate, etc) Knowledge of visualization tools like Tableau, Looker, Qlikview. Excellent spoken and written English. Individuals representing diverse profiles, and abilities, encompassing various genders, ethnicities, and backgrounds, are less likely to apply for this role if they do not possess solid experience in 100% of these areas. Even if it seems you don't meet our musts don't let it stop you, we are all about finding the best talent out there! Skills can be learned, and embracing diversity is invaluable. We believe driven talent deserves: An enticing equity plan that lets you own a piece of the action. Top-notch private health insurance to keep you at your peak. Monthly Glovo credit to satisfy your cravings! Discounts on transportation, food, and even kindergarten expenses. Discounted gym memberships to keep you energized. Extra time off, the freedom to work from home two days a week, and the opportunity to work from anywhere for up to three weeks a year! Enhanced parental leave, and office-based nursery. Online therapy and wellbeing benefits to ensure your mental well-being. Here at Glovo, we thrive on diversity, we believe it enhances our teams, products, and culture. We know that the best ideas come from a mashup of brilliant diverse minds. This is why we are committed to providing equal opportunities to talent from all backgrounds - all genders, racial/diverse backgrounds, abilities, ages, sexual orientations and all other unique characteristics that make you YOU. We will encourage you to bring your authentic self to work, fostering an inclusive environment where everyone feels heard. Feel free to note your pronouns in your application (e.g., she/her/hers, he/him/his, they/them/theirs, etc). So, ready to take the wheel and make this the ride of your life? Delve into our culture by taking a peek at our Instagram and check out our Linkedin and website! ",
          "application_url": "https://jobs.glovoapp.com/find-your-ride/job/data-scientist-product-analyst-(theyshehe)/7956481002/",
          "status": "Not Applied",
          "sentiment": "Neutral",
          "notes": "",
          "date_added": "2025-05-12 17:27:15",
          "location": "Barcelona, Spain",
          "salary": "Not Listed",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 4,
          "company_name": " Trustpilot",
          "job_title": "Senior Analytics Engineer ",
          "job_description": "Our vision is to be the universal symbol of trust, bringing consumers and businesses together through reviews. We are well on our way—but there’s still an exciting journey ahead. Join us at the heart of trust.\n\nAs an Analytics Engineer at Trustpilot, you'll be a crucial bridge between our business and technical teams, directly influencing Analytics, Data Science, Data Engineering, and Product. You'll leverage our cutting-edge modern data stack to expand and enhance our data warehouse, empowering data-driven decisions across the organisation. This role offers the exciting opportunity to shape our data landscape and contribute to innovative analytics solutions.\n\nWhat You’ll Be Doing\n\nMaintain and evolve our data warehouse and business intelligence tool, providing reliable data access to users throughout Trustpilot\nDesign, build, maintain, and rigorously monitor robust data pipelines and transformative models using our modern data stack, including GCP, Airflow, dbt, and potentially emerging technologies like real-time streaming platforms\nDevelop and manage reverse ETL processes to seamlessly integrate data with our commercial systems, ensuring operational efficiency\nMaintain and optimise our Customer Data Platform (CDP, ensuring effective data collection, unification, and routing\nAdminister and support our business intelligence tool, Looker, enabling users to provide insightful and user-friendly data visualisations\nIdentify opportunities to optimise our data warehouse and development methodologies, with the goal of reduced complexity, improved performance, and cost efficiency\nCollaborate with Analysts and Data Scientists to prepare and model data for predictive analytics and AI/ML initiatives\nImplement and maintain data observability and quality monitoring solutions, including custom alerting, to ensure the reliability and integrity of our data assets\nWork closely with Engineering teams to understand their data needs, collaborate on data integration projects (e.g., web tracking via tracking plans), and build collaborative working relationships\n\nWho You Are\n\nYou advocate a \"data as a product\" mindset, with a focus on documentation, rigorous reviews, and data accuracy\nYou are highly experienced in cloud data warehouses, modern data stacks, and best practices in data engineering\nYour proficiency in SQL includes a wealth of experience in data manipulation, querying, and optimisation\nYou are curious, proactive, and interested in the impact of data and technology in business\nYou advocate for test-driven development and understand the critical role of high-quality data\nYour communication and stakeholder management skills are highly skilled, allowing you to collaborate effectively across technical and non-technical teams\nYou can explain complex technical concepts clearly and succinctly\nYou thrive in cross-functional environments, working closely with Engineering, Data Science, and business teams\nExperience with CDP and event tracking platforms like Segment or Hightouch, particularly in event tracking governance\nFamiliarity with observability tools, data quality monitoring, and data DevOps practices\n\nWhat's in it for you? \n\nA range of flexible working options to dedicate time to what matters to you\nCompetitive compensation package + bonus\n25 days holiday per year, with an extra 5 days holiday allocated after your 1 year anniversary (prorated) \nTwo (paid) volunteering days a year to spend your time giving back to the causes that matter to you and your community\nRich learning and development opportunities are supported through the Trustpilot Academy and Blinkist\nComprehensive health package, pension, and full access to Headspace, a popular mindfulness app to promote positive mental health\nPaid parental leave\nCentral office with a laid-back vibe and constant buzz of different languages being spoken everywhere you go It’s complete with a coffee bar, canteen, and table tennis and has a wide variety of refreshments available - you can opt-in for breakfast and lunch at an affordable price\nRegular opportunities to connect and get to know your fellow Trusties, including company-wide celebrations and events, ERG activities, and team socials\nOpportunity to join the Trustpilot Social Club for a small monthly fee and attend regular social and leisure activities like go-karting, cooking classes, and escape rooms \nEmployee discounts to restaurants and shops\n\nAbout Us\n\nTrustpilot began in 2007 with a simple yet powerful idea that is more relevant today than ever — to be the universal symbol of trust, bringing consumers and businesses together through reviews. Trustpilot is open, independent, and impartial — we help consumers make the right choices and businesses to build trust, grow and improve.\n\nToday, we have more than 300 million reviews and 64 million monthly active users on average across the globe, with 140 billion annual Trustbox impressions, and the numbers keep growing. We have more than 1,000 employees and we’re headquartered in Copenhagen, with operations in Amsterdam, Denver, Edinburgh, Hamburg, London, Melbourne, Milan and New York.\n\nWe’re driven by connection. It’s at the heart of what we do. Our culture keeps things fresh –– it’s built on the relationships we create. We talk, we laugh, we collaborate and we respect each other. We work across borders and cultures to be the universal symbol of trust in an ever-changing world. With vibrant office locations worldwide and over 50 nationalities, we’re proud to be an equal opportunity workplace with diverse perspectives and ideas.\n\nOur purpose to help people and businesses help each other is a tall order, but we keep it real. We’re a great bunch of humans, doing awesome stuff, without fuss or pretense. A successful Trustpilot future is driven by you –– we give you the autonomy to shape a career you can be proud of. If you’re ready to grow, let’s go.\n\nJoin us at the heart of trust.\n\nTrustpilot is committed to creating an inclusive environment where people from all backgrounds can thrive and where different viewpoints and experiences are valued and respected. Trustpilot will consider all applications for employment without regard to race, ethnicity, national origin, religious beliefs, gender identity or expression, sexual orientation, neurodiversity, disability, age, parental or veteran status. Together, we are the heart of trust.\n\nTrustpilot is a global company and our data practices are designed to ensure that your personally identifiable information is appropriately protected. Please note that your personal information will be transferred, accessed, and stored globally as necessary for the uses and disclosures stated in our Privacy Policy.",
          "application_url": "https://www.linkedin.com/jobs/search/?currentJobId=4226502183&geoId=91000000&keywords=data%20scientist&origin=JOB_COLLECTION_PAGE_KEYWORD_AUTOCOMPLETE&refresh=true",
          "status": "Rejected",
          "sentiment": "Neutral",
          "notes": "Interesting role, just something that catches my interest. Not sure that I am ready to apply.",
          "date_added": "2025-05-12 17:36:33",
          "location": "Copenhagen, Denmark",
          "salary": "Not Listed",
          "applied_date": "2025-05-12",
          "user_id": 8
        },
        {
          "id": 8,
          "company_name": "Spotify",
          "job_title": "Data Engineer",
          "job_description": "The Hendrix Feature team is dedicated to developing a robust, Spotify-wide platform for machine learning features. This platform streamlines the productization of ML models by mitigating the incidental complexities involved in creating and maintaining Features, both in their lineage, offline states, and online states. Identifies collaboration opportunities that support the teams and those working with the team/Features (other team and leads) and helps people with different perspectives be successful in their work together. Is a team-level expert in a primary domain or drives solutions to a broad set of problems across multiple domains for the squad. Delivers on large, complex tasks for features as defined and on schedule, managing all dependencies and communication cross-functionally. Mentor other engineers, developing their skills and setting an example for engineering standards at Spotify. Consider the inter-squad connections between features and the rest of the machine learning product area, and Spotify wide machine learning ecosystem. You have 3+ years of hands-on experience implementing production machine learning infrastructure at scale in Python, Java, Scala, or similar languages. You have a general understanding of data processing concepts. You have experience with agile software processes and modular code design following industry standards. You have deep experience with developing data processing systems at scale and optimizing for performance. This role is based in Stockholm. We offer you the flexibility to work where you work best! There will be some in-person meetings, but still allows for flexibility to work from home. Extensive learning opportunities, through our dedicated team, GreenHouse. Flexible share incentives letting you choose how you share in our success. Global parental leave, six months off - fully paid - for all new parents. All The Feels, our employee assistance program and self-care hub. Flexible public holidays, swap days off according to your values and beliefs.",
          "application_url": "https://www.lifeatspotify.com/jobs/data-engineer-learning-infrastructure",
          "status": "Applied",
          "sentiment": "Negative",
          "notes": "More for testing purposes, may not apply",
          "date_added": "2025-05-13 00:46:04",
          "location": "Stockholm, Sweden",
          "salary": "Not Listed",
          "applied_date": "2025-05-13",
          "user_id": 8
        },
        {
          "id": 9,
          "company_name": "Jerry",
          "job_title": "Data Scientist",
          "job_description": "Jerry is looking for a Data scientist to join our growing team! We hit a huge milestone in early 2024 by achieving profitability and have ambitious goals for the next few years — scale from 5M to 50M customers and become a $10B business. As a data scientist, you will play a key role in championing data-driven decisions across the company, with a focus on optimizing growth channels such as partnerships, marketing, and automation. Reporting directly to the Director BizOps/Analytics, you will leverage advanced machine learning models to conduct in-depth analyses and extract insights that will shape our growth strategies. Jerry is building the first super app to make car ownership affordable and accessible – insurance, buy/sell, registration, loans, safety, repairs, parking, etc – a $2T market in the U.S. We started with insurance in 2019, and since then we’ve launched loan refinancing, driving insights, repair marketplace, car diagnostics, and a GenAI-powered chatbot & voicebot. We have amassed over 5M customers, raised $240MM in funding, scaled our revenue 60X and our team to 225 across 6 countries. How you will make an impact: Partner with marketing, product, and business development teams to integrate customer performance insights into user and partner acquisition strategies Lead the design, execution, and analysis of A/B experiments on new and existing features, extracting key insights to inform product and business strategies Define, understand, and test levers to drive profitable and scalable user acquisition and partnership growth Identify opportunities to automate manual processes and optimize operational efficiency Preferred experience: Bachelor’s degree in a quantitatively or intellectually rigorous discipline 1-3 years of management consulting experience from a top firm (McKinsey, Bain, and Boston Consulting Group preferred) OR relevant experience in data science/business analysis High level of comfort with SQL or Python",
          "application_url": "https://jobs.ashbyhq.com/Jerry/69c50995-c0c9-42ab-a00f-95a99eaf98d5?utm_source=6Vdva5VPyD",
          "status": "Applied",
          "sentiment": "Neutral",
          "notes": "American company, the role might be a bit junior so that could be a concern but the start up seen could suit me. Remote in Canada could work",
          "date_added": "2025-05-13 15:07:39",
          "location": "Toronto, Ontario (Remote)",
          "salary": "Not Listed",
          "applied_date": "2025-05-13",
          "user_id": 8
        },
        {
          "id": 10,
          "company_name": "Glovo",
          "job_title": "Automation Data Analyst I",
          "job_description": "If you’re here, it’s because you’re looking for an exciting ride. A ride that will fuel up your ambitions to take on a new challenge and stretch yourself beyond your comfort zone. We’ll deliver a non-vanilla culture built on talent, where we work to amplify the impact on millions of people, paving the way forward together. Not your usual app. We are the fastest-growing multi-category app connecting millions of users with businesses, and couriers, offering on-demand services from more than 170,000 local restaurants, grocers and supermarkets, and high street retail stores. We operate in more than 1500 cities across 25 countries. Together we revolutionize the way people connect with their everyday needs, from delivering essentials to connecting our ecosystem of users through innovative solutions powered by technology. For us, every day is filled with purpose. What makes our ride unique? Our culture and strong values. Our career development philosophy. Our commitment to being a force for good. We have a vision: To give everyone easy access to anything in their cities. And this is where your ride starts. YOUR MISSION: Support the optimization of logistics features, with a focus on delivery areas and supply/demand imbalances, by maintaining and improving settings, quantifying their impact, providing data-driven insights, coordinating feature rollouts, and measuring their effectiveness. THE JOURNEY: Develop and maintain scalable and self-service visualization tools and storytelling dashboards. Build optimization processes to define the best tuning of every feature on each geography. Support recurrent processes within the team, enabling the adjustment of tools to business needs Continuously explore and refine key operational metrics (delivery time, efficiency, costs), gaining a comprehensive understanding of Glovo’s logistics. Deep-dive on business metrics, in order to explore areas of opportunity and enable data-driven decision-making, based on applied statistics and probability techniques Build robust relationships with stakeholders acting as a strategic and supportive link between the technology, business and product. Work closely with local/regional stakeholders, product teams and development teams, serving as a bridge between product and operations, to define how to best set up and enable products, monitor and give visibility of metrics and KPIs. WHAT YOU WILL BRING TO THE RIDE: 1-2 years of professional experience outside of an academic and internship setting, in a quantitative analysis role Solid proficiency in programming (Python/R) and experience working with popular tools such as Pandas, SciPy, Seaborn, Jupyter/iPython notebooks, R Markdown. Excellent SQL skills Excellent Excel/Google Sheet skills Knowledge of visualization tools like Tableau, Looker, PowerBI, ... Excellent problem-solving and analytical skills Great spoken and written English. Individuals representing diverse profiles, encompassing various genders, ethnicities, and backgrounds, are less likely to apply for this role if they do not possess solid experience in 100% of these areas. Even if it seems you don't meet our musts don't let it stop you, we are all about finding the best talent out there! Skills can be learned, and embracing diversity is invaluable. Top-notch private health insurance to keep you at your peak. Monthly Glovo credit to satisfy your cravings! Cobee discounts on transportation, food, and even kindergarten expenses. Discounted gym memberships to keep you energized. Extra time off, the freedom to work from home two days a week, and the opportunity to work from anywhere for up to three weeks a year! Enhanced parental leave, and office-based nursery...Online therapy and wellbeing benefits to ensure your mental well-being. Here at Glovo, we thrive on diversity, we believe it enhances our teams, products, and culture. We know that the best ideas come from a mashup of brilliant diverse minds. This is why we are committed to providing equal opportunities to talent from all backgrounds - all genders, racial/diverse backgrounds, abilities, ages, sexual orientations and all other unique characteristics that make you YOU. We will encourage you to bring your authentic self to work, fostering an inclusive environment where everyone feels heard. Feel free to note your pronouns in your application (e.g., she/her/hers, he/him/his, they/them/theirs, etc). So, ready to take the wheel and make this the ride of your life? Delve into our culture by taking a peek at our Instagram and check out our Linkedin and website!",
          "application_url": "https://jobs.glovoapp.com/find-your-ride/job/automation-data-analyst-i-(theyshehe)/7657953002/",
          "status": "Not Applied",
          "sentiment": "Neutral",
          "notes": "Maybe a bit too junior of a role",
          "date_added": "2025-05-14 13:31:35",
          "location": "Barcelona, Spain",
          "salary": "Salary information not provided",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 11,
          "company_name": "Klarna",
          "job_title": "Senior Analytics Engineer ",
          "job_description": "As a Senior Analyst within the Liquidity & FX Operations team—part of Klarna’s Treasury domain—you will work at the intersection of financial strategy and operational execution. You’ll play an instrumental role in managing Klarna’s liquidity and derivative portfolios, currently at SEK 100+ billion in notional value. Your day-to-day includes performing pre-trade analysis, executing trades across debt securities and derivatives, as well as conducting post-trade evaluations. You'll also be involved in managing Klarna’s currency and interest rate risk exposures, helping design and improve strategies that balance risk and return. Expect to gain exposure to the global FX and bond markets, and the chance to be a part of building a scalable Treasury organization. Demonstrated interest in financial markets, particularly FX and fixed income instruments Proficient in SQL for querying, data analysis, and portfolio reporting Strong analytical thinking with structured problem-solving skills Able to communicate insights clearly and collaborate effectively with diverse stakeholders Ambitious and eager to learn in a fast-paced environment Hold a university degree in related field (e.g. Economics, Finance, Engineering, Science, or Business) Have 2-7 years of relevant work experience Understanding of accounting principles and financial reporting Familiarity with banking regulations and guidelines Knowledge of Python for data analysis and automation Experience working with financial instruments or exposure to a trading environment",
          "application_url": "https://klarnagroup.teamtailor.com/jobs/5897252-senior-analyst?s=LinkedIn",
          "status": "Rejected",
          "sentiment": "Neutral",
          "notes": "Ideal company to work at within Europe",
          "date_added": "2025-05-16 12:44:19",
          "location": "Stockholm, Sweden",
          "salary": "Salary will be determined based on skills and experience. Additionally, you may qualify for our Contribution-Based Reward (CBR) program.",
          "applied_date": "2025-05-16",
          "user_id": 8
        },
        {
          "id": 12,
          "company_name": "Alquemy Search & Consulting",
          "job_title": "Senior Data Consultant",
          "job_description": "Sr. Data Consultant\n\n8 month contract till end of the year, expected to extend\n\n\"Hybrid\" work environment - 3 days per week in downtown Vancouver office\n\nDesired skills & experience:\n7+ years of professional experience in Data Analysis\nC-Level presentation experience\nReporting\nFocus on strategy/business development experience\nDiscovery/exploring options for senior leaders to make educated decisions on data\nAny experience within B2B domain Mobile Device Management (MDM) or Managed Service Provider (MSP) or related business is a plus\n\n$80 - $90 per hour for an INC consultant, flexible related to experience\n\nBased on 40 hours per week\n\nIf you're interested, please apply with resume and I will be in contact quickly with additional details and next steps",
          "application_url": "https://www.linkedin.com/jobs/view/4226550567/?alternateChannel=search&refId=%2F%2FJr2zymqpvdnzxZYXnVfw%3D%3D&trackingId=mly8sq5fWM42vl4PstiGGg%3D%3D",
          "status": "Applied",
          "sentiment": "Positive",
          "notes": "Saw it on LinkedIn, handy contract roll.",
          "date_added": "2025-05-19 18:36:06",
          "location": "Vancouver, Canada",
          "salary": "150000",
          "applied_date": "2025-05-19",
          "user_id": 8
        },
        {
          "id": 13,
          "company_name": "Wallapop",
          "job_title": "Data Analyst",
          "job_description": "As a Data Analyst, you will be responsible for working with large datasets to uncover trends, patterns, and correlations. You will transform data-driven insights into strategic recommendations for stakeholders at all levels, ranging from product teams to tribe leads and company leadership. Collaborating closely with Product, Marketing, Data, and Tech teams, you will design and execute experiments, conduct quantitative research, and ensure continuous access to high-quality data and insightful visualizations. Developing metrics, key performance indicators (KPIs) and performance measurement frameworks. Identifying growth opportunities through data trends using time-series analysis and predictive modeling. Extracting quantitative insights from data, and translating them into actionable recommendations to address knowledge gaps and drive business impact. Creating and managing dashboards, enabling easy data access for the stakeholders. Maintaining data pipelines to ensure efficient data flow and accessibility, and ensuring data quality. Designing, executing and interpreting A/B tests to evaluate product features or marketing strategies. Conducting exploratory data analysis (EDA) to understand data characteristics, user segments and market evolution. Contributing to high-quality documentation for metrics, analyses and data models. Promoting data literacy and a data-driven mindset within the team and the organization. Proven experience in a Data Analyst role, preferably in a fast-paced, data-driven environment. Expert-level proficiency in SQL and data visualization tools (e.g., Tableau, Looker, etc.). Strong analytical skills with the ability to extract meaningful insights from complex datasets. Excellent communication and presentation skills, capable of conveying complex data insights to both technical and non-technical stakeholders. Experience in defining and implementing metrics and data models. Solid understanding of statistical concepts, methodologies, and their practical applications. Proactive and collaborative mindset, with a proven ability to work effectively across cross-functional teams. Passion for data and a strong commitment to data-driven decision-making. Familiarity with Data Warehousing and ETL processes. Knowledge of programming languages such as Python or R. Proficiency with version control systems, particularly Git. Basic experience in training and applying Machine Learning models and techniques. Experience working with large datasets and cloud-based data platforms (e.g., AWS, GCP, Azure). Domain expertise in marketplaces or classifieds. Exposure to qualitative research methodologies. Do note that all our jobs are 📍 Barcelona based. We follow a hybrid model where flexibility rules. We commit to a minimum of 6 days per month in the office. Each team self-organizes to decide on cadence and in-person/remote rituals.",
          "application_url": "https://job-boards.eu.greenhouse.io/wallapop/jobs/4535028101",
          "status": "Not Applied",
          "sentiment": "Neutral",
          "notes": "Like the location",
          "date_added": "2025-05-20 14:05:26",
          "location": "Barcelona, Spain",
          "salary": "Not Listed",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 14,
          "company_name": "Booking.com",
          "job_title": "Data Scientist",
          "job_description": "Role Description: As a Data Scientist II, you will be working within the Flights Data Science & Analytics team and you will be involved in various stages of data science solutions, from ideation to implementation. You will be working independently on data consumption and preparation, effectively solving business problems through statistical data analysis and modeling. This role involves interpreting experimental data to guide business decisions, uncovering new opportunities, and engaging with stakeholders. As a Data Scientist II you are expected to continuously learn, expand your technical competencies, engage with peers, and understand the larger data ecosystem and the goals for Flights. You are also responsible to ensure the quality of your work through peer review. As a successful candidate you will be collaborating closely with the Apps Discovery and Engagement team, and with the broader Flights CCJ DSnA team... Key Job Responsibilities and Duties: Responsible for owning the design and delivery of entire Data Science solutions based on business requirements, bringing them from the initial idea-generation phase to implementation independently. Responsible for working autonomously on consuming data, preparing it for data science use, translating business problems to data stories and solving them effectively by applying suitable statistical data analysis and modeling methods. Leverages input from business stakeholders in all of the above to determine the right technical solutions to deliver customer value. Responsible for designing and interpreting quantitative experiments to objectively guide key business decision making. Responsible for independently identifying and managing stakeholders in operational, project-based, and managerial roles. Effectively communicates, addresses stakeholder needs, and conveys complex analysis results in a clear manner. Flag roadblocks, prioritizes their workload, and manage expectations with stakeholders. Begins to guide junior colleagues in stakeholder engagement. Responsible for being flexible in adopting existing internal and external Data Science approaches, proposing and spotting opportunities to apply new approaches and expanding their technical competencies and their peers when a more efficient way presents itself. Responsible for ensuring quality of their own work by validating it through peer review. Role Qualifications and Requirements: Master degree, or equivalent experience in a quantitative field (Statistics, Mathematics, Econometrics, Computer Science, Physics, Engineering, Bioinformatics, or similar). PhD or 3+ years of experience. Experience solving real problems using data mining techniques and with statistical rigor. Strong technical skills regarding data analysis, statistics, machine learning and programming. Strong working knowledge of Hadoop, Spark, SQL, Python and/or R. Excellent communication skills. Strong skills in translating business problems into data problems. Strong data visualization skills. Strong knowledge of Statistical Methods (e.g. Testing, GLM, Inference), Statistical/Machine Learning (e.g. Dimension Reduction, Clustering, Regularisation, Bagged/Boosted methods), Relational Markov models, Time Series, etc. Strong knowledge of data management (engineering, data pipelines, workflows). Strong knowledge of the possibilities and limitations of different types of data analysis and/or data science modelling.",
          "application_url": "https://jobs.booking.com/booking/jobs/19717?lang=en-us&iis=Job+Board&iisn=Linkedin",
          "status": "Not Applied",
          "sentiment": "Neutral",
          "notes": "Good role - challenging and technical. The location is a bonus",
          "date_added": "2025-05-20 14:41:23",
          "location": "Amsterdam, Netherlands",
          "salary": "Not Listed",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 15,
          "company_name": "GetYourGuide",
          "job_title": "Senior Data Analyst",
          "job_description": "About GetYourGuide: GetYourGuide is the globally leading marketplace for unforgettable travel experiences. Travelers use GetYourGuide to discover the best things to do in a destination. Since its founding in 2009, travelers from over 170 countries have booked more than 200 million tours, activities, and attraction tickets through GetYourGuide. Powered by a global team of over 700 travel experts and technologists, we are headquartered in Berlin and have 17 local offices around the world. Visit our careers website to learn more. Team Mission: The Analytics department's mission is to enable the organisation to take action based on data. We work on a variety of problems and datasets as members of cross-functional mission teams. We take ownership of the entire analytics funnel, from exploration through recommendations to impact measurement and take pride in the insights we generate. As a Data Analyst in the Product Analytics team, you will help drive measurement, strategy, and tactical decision-making within GetYourGuide. You will solve problems that could range from understanding the relationship between review rating and conversion rate, figuring out how to measure adding videos to our product pages, what is the business value of an account login or developing a way to measure whether our customers’ on-trip experience is optimal. Responsibilities: Develop quantitative analysis to drive product decisions. Help the Search and Discovery group to learn about their features by designing and analyzing experiments. Design and implement data models, metrics and dashboards to guide the teams’ product strategy and success. Support the technical teams in tracking and producing more insightful data. Contribute to the learning and experimentation culture of the company by promoting hypothesis-driven product development and evaluation. Answer the big questions to push our knowledge of our customers further. Contribute to the strategic thinking of the team by being a thought partner to the Product Manager. Requirements: 5+ years of relevant experience interpreting data in an analytics, data science or business intelligence role Excellent stakeholder management skills. Strong knowledge of SQL and knowledge of Python Experience with data visualization and reporting tools (e.g. Looker, Jupyter Notebooks) Curiosity, reasoning skills with proven evidence of problem solving. Ability to understand user behavior and meaning behind the numbers Desire to work in an international environment, with minimal direction and with highly engaged individuals Ability to navigate ambiguity. Strong customer focus with a focus on business impact. Great communication skills Nice to have: Previous experience working with agile product teams is a plus. Previous experience managing analysts is a plus. Experienced with the statistics and assumptions of experimentation. Familiarity with ETL technologies like Airflow is a plus. Experience with big data tools (e.g. Spark, Hive) is a plus. Experience with LLM APIs (OpenAI, Gemini, Anthropic) is a plus. We Offer: Meaningful work that helps create memorable travel experiences. The opportunity to contribute to the A diverse, inclusive environment where your voice is valued Collaboration with smart, engaged colleagues from over 80 nationalities English-speaking office environment Continuous learning opportunities through monthly Hackathons, weekly tech talks, and an annual external training budget Mentorship programs to support your growth and career development Flexible working arrangements to support work-life balance Well-stocked kitchen and team-building events GetYourGuide vouchers And more... We look forward to hearing from you Unlock your full potential and join our mission to create unforgettable experiences for millions around the world. If you have the skills and passion for joining our team, we invite you to apply by submitting your CV/resume in English through the form below.",
          "application_url": "https://www.getyourguide.careers/jobs/6758701?gh_jid=6758701&gh_src=8da695af1",
          "status": "Not Applied",
          "sentiment": "Neutral",
          "notes": "Dream to live in Berlin - potentially have a reference with Chris Mark. ",
          "date_added": "2025-05-20 16:44:34",
          "location": "Berlin, Germany",
          "salary": "Not Listed",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 16,
          "company_name": "Archer Recruitment",
          "job_title": "Senior Data Analyst",
          "job_description": "Fully Remote!\nClear Progression to Principal!\nEnjoy Global Recognition Working for a Multinational Org!\n\nAre you an experienced Senior Data Analyst? Do you go far beyond the basic requirements of Gathering Requirements and Building Dashboards? Have you ever imagined yourself working at a highly competitive, rapidly growing company? Well, you may have just found the opportunity you’ve been longing for.\n\nHave you mastered the use of tools such as SQL, Looker, Tableau and Power BI? Do you thrive in the art of story-telling and persuasion? My client is searching for Top-Talent in the Data Space to join their company and use their understanding of data analysis to Drive Business Processes and add real value to a company that aims to dominate its field in the not-too-distant future. \n\nIn this role, you’ll Deliver Insights, Compare Old and New Data to improve business processes and revolutionize projects on a Global Scale to save both Time and Money as you play your part in ensuring the continued success of an already high-functioning company.\n\nYou will:\n\nDeliver impactful insights\nCollaborate with key-stakeholders\nGain exposure to global scale FinTech projects\n\nSkills / Experience:\n\n5+ years’ in a Senior Data Analyst role\nStrong SQL skills (Snowflake, BigQuery, Oracle etc)\nStrong Reporting/Visualisation skills (Looker, Tableau etc)\n\nSalary / Remuneration: Up to €55,000 + 5% Bonus\n\nInterested? Contact Brandon McCann confidentially on +353 1 960 9976 or email your CV to brandon.mccann@archer.ie \n\nI specialise in recruiting in the Data, if you wish to discuss this or other role opportunities, please feel free to contact me. \n\nFor more opportunities, visit: https://www.archer.ie/candidates/\n\nAbout Archer – Archer Recruitment is a Specialist IT Recruitment Consultancy based in Ireland.",
          "application_url": "https://www.linkedin.com/jobs/view/4228256274/?alternateChannel=search&refId=PgBi1Ku9Yzo3b5LAEiP0YQ%3D%3D&trackingId=BcXoBP5Zfd33uMc8necbiA%3D%3D",
          "status": "Applied",
          "sentiment": "Negative",
          "notes": "Money is low, but the lifestyle would be good",
          "date_added": "2025-05-21 19:23:46",
          "location": "Europe",
          "salary": "55000 EUR",
          "applied_date": "2025-05-21",
          "user_id": 8
        },
        {
          "id": 17,
          "company_name": "Amboss",
          "job_title": "Senior Data Analyst",
          "job_description": "Hello, we are AMBOSS and we are looking for a Senior Data Analyst to join our team!\n\nAbout AMBOSS\n\nAMBOSS is a learning and clinical decision support tool striving to empower physicians across the globe to provide the best possible care. Our founders set out in 2011 to create a tool that they would have hoped to have as medical students and doctors. Since then we have grown to currently operate in 180 countries and have gained immense traction in Germany and the US. Currently, we are pursuing this mission with more than 500+ employees in our offices in Berlin, Cologne, New York, and Cagliari.\n\nWhy Data & Analytics at AMBOSS\n\nJoin a high-trust, cross-functional team where data is the backbone of every product decision, experiment, and growth bet. Working side-by-side with Product, Engineering, Commercial, and Medical colleagues, you will turn a modern stack into reliable insights and scalable pipelines. Your contributions guide decisions that reach millions of learners and clinicians worldwide, directly advancing our mission to enable doctors to provide the best possible care.\n\nBusiness Impact\n\nOwn the analytics strategy for all AMBOSS product domains—from user acquisition and onboarding through learning flows, clinical decision support, and commercial touch‑points. Partner with senior leadership to set KPIs, expose the biggest opportunities, and turn insights into roadmap and revenue impact. Guide the analytics craft across the organisation.\n\nRole Overview\n\nA hands‑on yet strategic role: you will lead end‑to‑end analytics initiatives, coach analysts, and advance data quality and experimentation standards.\n\nWhat You Will Do\n\n\nDefine the analytics roadmap across onboarding, in‑product engagement, clinical usage, and shop flows.\nDrive deep‑dives (causal inference, cohort modelling, forecasting) and present recommendations to VP/C‑level stakeholders.\nDesign, run, and evaluate A/B and multivariate tests; embed best practices across teams.\nOwn core KPI frameworks and align measurement standards company‑wide.\nIdentify data gaps, specify event‑tracking, and collaborate with Engineering on data reliability.\nMentor mid‑level and junior analysts; lead knowledge‑sharing sessions.\nChampion scalable self‑service tooling and shape the evolution of our analytics stack. \n\n\nWhat you bring\n\n\n5 + years in product or marketing analytics within SaaS or consumer digital products.\nExpert SQL plus strong Python or R skills for statistical modelling.\nDemonstrated record of translating analysis into product or revenue wins.\nDeep understanding of experimental design, causal methods, and forecasting.\nExperience with BI / event‑tracking tools (Looker, Mixpanel, dbt, etc.).\nClear, persuasive communication with both technical and executive audiences.\nProven leadership: mentoring, stakeholder management, prioritisation. \n\n\nYou enjoy\n\n\nOwning strategic questions end‑to‑end.\nElevating team capabilities.\nBalancing quick wins with long‑term analytical foundations.\n\n\nBenefits\n\nAMBOSSians tell us that innovative work keeps them energized and employee benefits help them to feel appreciated and empowered. We invest in every AMBOSSian with our employee benefits package, crafted to support financial, physical, and mental health, and work-life harmony.\n\nCheck out all of our employee benefits in Germany below:\n\nhttps://go.amboss.com/the-amboss-prescription-de\n\nWe believe in diversity as a driving force of innovation and welcome people of all backgrounds to help us achieve our mission of empowering physicians to provide the best possible care - to everyone, everywhere.\n\nDid we just describe your ideal next role? We encourage you to apply even if you do not meet all of the requirements.",
          "application_url": "https://www.linkedin.com/jobs/view/4228256274/?alternateChannel=search&refId=PgBi1Ku9Yzo3b5LAEiP0YQ%3D%3D&trackingId=BcXoBP5Zfd33uMc8necbiA%3D%3D",
          "status": "Applied",
          "sentiment": "Neutral",
          "notes": "Berlin would be an amazing place to work",
          "date_added": "2025-05-21 19:26:01",
          "location": "Berlin, Germany",
          "salary": "Not Listed",
          "applied_date": "2025-05-21",
          "user_id": 8
        },
        {
          "id": 18,
          "company_name": "Barden",
          "job_title": "Senior Data Analyst",
          "job_description": "Barden have been asked to act on behalf of a global technology company who are looking to add an experienced Senior Data Analyst to their team in Dublin. This person will join a new team which is forming as part of a major finance project within this organisation.\n\n\nAbout the person:\n\n\n\nIdeally you will have at least 5+ years commercial experience in Data Analytics building reports on financial data with an emphasis on Tableau and PowerBI to build cutting edge dashboards.\nThis role requires a person with a strong understanding of financial data systems, in particular, accountancy systems.\nYou will have experience extracting data from multiple sources to create reports.\nWe are looking for people with strong stakeholder management experience with a passion for financial data analysis working amongst complex financial accounting systems.\n\n\nAbout the role:\n\n\n\nAs part of this new team you will play a key role is this global project.\nYour Data Analysis skills and techniques will be at the forefront.\nGiven the nature and sheer size of the project it's a very exciting opportunity for someone with the relevant experience to enhance their career.\nIf you are a technical data analyst with PowerBI / Tableau, who has vast experience in financial data systems, possibly coming from a consultancy background this could be an excellent opportunity for you so feel free to reach out to me on dan.hoctor@barden.ie\n\n\nThis role is hybrid and you will be required to work in the office 2 to 3 days per week in Dublin.",
          "application_url": "https://www.linkedin.com/jobs/view/4228459986/?alternateChannel=search&refId=PgBi1Ku9Yzo3b5LAEiP0YQ%3D%3D&trackingId=BGbYIbG24%2B4f9GaVqIczKQ%3D%3D&trk=d_flagship3_search_srp_jobs",
          "status": "Applied",
          "sentiment": "Neutral",
          "notes": "Not pushed on living in Ireland",
          "date_added": "2025-05-21 19:27:31",
          "location": "Dublin, Ireland",
          "salary": "Not Listed",
          "applied_date": "2025-05-21",
          "user_id": 8
        },
        {
          "id": 20,
          "company_name": "ZestyAI",
          "job_title": "Data Scientist, Analytics",
          "job_description": "Events in recent years have made us all too familiar with the havoc that natural disasters can wreak, and the increasing frequency and intensity with which they are occurring. Despite record levels of losses, conventional methods of risk modeling continue to paint at best an incomplete picture of these threats. ZestyAI uses novel data gathering and data science methods to produce higher quality information about the risks to property from catastrophes like floods and wildfires. While AI alone may not be able to thwart these disasters, it can help us become more prepared for them, and ultimately that will lead to better outcomes. As a Data Scientist, Analytics, you are comfortable and excited to work closely with the engineering team to build the best AI tech possible. You will scale the development of top-tier models by using diverse data sources to provide strong insights and maximize the impact of our company efforts. You thrive in a collaborative, creative environment that moves fast and are comfortable implementing structures and processes to help the company scale. The Opportunity: Develop automated ETL and data workflows Spearhead product monitoring and quality assurance by designing and owning dashboards and KPIs Translate product management, engineering, and business constraints and queries into tractable data science questions Exploring data sets and developing new InsureTech models with data science (Machine learning, Deep learning) Iterate rapidly on everything; all of the above happens in a fast-paced business-driven environment that you must be comfortable with What You Bring to the ZestyAI Team: BA / BS degree in Math, Physics, Engineering, Computer Science, or Economics MS or Ph.D. is certainly a bonus 2 - 3 years of experience in designing and building ETL workflow and monitoring dashboards Strong organizational and management skills with past experiences Implementing best practices and processes Proficient in SQL Proficient in programming language (Python or R) Experience working with cloud platforms (Google Cloud Platform, AWS, etc) Must be legally eligible to work in Canada Nice to Have: 1 - 2 years of experience working with imagery and/or geospatial data Working knowledge of modeling framework and performance metrics DBT Experience Prefect (or another workflow tool like Airflow) Experience Data Visualization Experience Why ZestyAI: Be part of a well-funded growth-stage company Market competitive comp and equity incentives to give you a stake in our future Comprehensive health care plan Flexible Time Off An upbeat and collaborative work culture Company-sponsored outings and offsites",
          "application_url": "https://job-boards.greenhouse.io/zestyai/jobs/6271910003?gh_src=491e34fc3us",
          "status": "Not Applied",
          "sentiment": "Neutral",
          "notes": "Could be a little junior.",
          "date_added": "2025-06-02 15:18:52",
          "location": "Remote, Quebec",
          "salary": "Not specified",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 21,
          "company_name": "MindBridge AI",
          "job_title": "Data Support Analyst",
          "job_description": "Global Services GSO (500) - Canada (Remote)\nMindBridge AI is the world's leading AI powered financial risk discovery platform. We help financial professionals access better ways of working by identifying, surfacing, and analyzing risk across broad financial datasets. Data Management sits at the heart of our business. As a valued team member, you will be responsible for providing advanced data support to our key customers. Your data transformation skills and expertise in diagnosing issues will be invaluable in guiding MindBridge customers and the team to the right solutions. In this role, you will: Provide data transformation support through tickets Clean, format, and transform large datasets using Python or Excel Research, document and provide executable solutions to data issues, by leveraging internal tools and collaborating cross-functionally as necessary Provide professional customer support including courteous and timely communication throughout all levels of interaction Understand and translate complex product and technical concepts to non-technical customers Collaborate cross-functionally to build and execute smooth ETL transition processes from Implementation to Support, including data loads through the API Employ continuous improvement methodologies within the workspace, identifying and removing waste processes Lead the creation and enhancement of data issues resolution workflows, technical documentation, including data requirements and FAQs Support the greater Global Services team on ad-hoc data ingestion projects for strategic customers Work in cross-functional teams to deliver large scale data ingestion projects Leverage APIs to improve internal processes and workflows Be the data ingestion product expert and stay up to date on new features Provide feedback and influence the product decisions based on customers' data needs Take an active role in software/release testing To be successful in this role, you: Are proficient in manipulating large, complex datasets using Python Are comfortable with maintaining API requests Can create API requests Are dedicated to delivering exceptional support and exceeding customer expectations Are data-driven and have strong analytical and problem-solving skills Can adjust priorities on the fly and thrive in a fast-paced environment and culture Are comfortable learning complex software and delivering training to non-technical users Can navigate complex customer organizations and manage feedback professionally Have strong communication skills and can comfortably communicate with customers from a wide variety of backgrounds Are willing to support customer requirements that, on occasion, fall outside of normal business hours, such as providing support coverage for UK or EU customers Desired education and experience: Must be permanently located within the EST time zone in Canada 3+ years of experience in a customer facing role providing customer service, consulting, or support role in a software/technology company Experience with CRMs and ticketing systems such as Jira, Zendesk, etc. Advanced scripting and data cleansing experience in Python. Knowledge of the Pandas and NumPy libraries preferable. Proficient with Microsoft Excel (formulas, formatting etc.) Computer Science/Accounting/Business degree or equivalent experience required Experience with ERP systems (NetSuite, Sage, SAP, etc.) is an asset Knowledge of processes, development, and operational ability in diverse ETL environments (Informatica, DataStage and/or Talend) is an asset Financial audit or accounting experience is an asset Requirements contingent on employment: Fulfill requirements necessary to obtain full background check.",
          "application_url": "https://mindbridge.bamboohr.com/careers/266",
          "status": "Not Applied",
          "sentiment": "Neutral",
          "notes": "Remote in Canada would be ideal - it would allow me to continue to travel and work.",
          "date_added": "2025-06-03 15:48:05",
          "location": "Canada (Remote)",
          "salary": "Not provided",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 22,
          "company_name": "Spotify",
          "job_title": "Associate Data Scientist - Growth Analytics",
          "job_description": "We are looking for a Data Scientist to join the Business Analytics team at Spotify. You will work with the Growth Analytics Lead to evaluate and influence our global growth strategy. You will collaborate with a distributed team of world-class analysts, data scientists, business leaders, marketers, and engineers. Learning and improving is part of our daily routine, and you will get a platform to develop your data skills and carve out efficient ways of working. The Business Analytics team is part of Spotify’s core business strategy organization. You’ll play a crucial role in the growth and direction of Spotify as we grow to 700M+ users around the globe. At your fingertips, you’ll have access to all of the data Spotify has to offer, and the opportunity to be creative with how you use it to derive insights and strategies. Above all, your work will impact the way the world experiences audio! What You'll Do Develop data driven strategies to drive the growth of Spotify users and subscribers Design and implement comprehensive tests, making sure that we track all relevant metrics and that we’re learning at every step along the way Create and communicate impactful recommendations and models that improve our product offering, user messaging, and channel optimization Build scalable data pipelines and dashboards to facilitate business performance tracking Work closely with business partners to understand the change they are driving and help them discover new opportunities for growth Present your findings to senior collaborators, influencing the course of our business Who You Are Recently completed Bachelor’s or Master’s degree in Mathematics, Computer Science, Data Science or other relevant field Experience synthesizing insights from data using tools such as Python/R and SQL Intellectually curious, creative, and diligent - you enjoy thinking about the business as much as about the data Comfortable using AI-powered tools to accelerate analysis and improve productivity Comfortable working on a globally distributed team (with occasional international travel) Where You'll Be This role is based in London We offer you the flexibility to work where you work best! There will be some in person meetings, but still allows for flexibility to work from home. We ask that you come in 3 times per week.",
          "application_url": "https://www.lifeatspotify.com/jobs/associate-data-scientist-growth-analytics",
          "status": "Not Applied",
          "sentiment": "Neutral",
          "notes": "Dream company for me, I love music",
          "date_added": "2025-06-12 12:20:29",
          "location": "London, United Kingdom",
          "salary": "Not specified",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 23,
          "company_name": "Coinbase",
          "job_title": "Senior Analytics Engineer",
          "job_description": "Ready to be pushed beyond what you think you’re capable of? At Coinbase, our mission is to increase economic freedom in the world. It’s a massive, ambitious opportunity that demands the best of us, every day, as we build the emerging onchain platform — and with it, the future global financial system. To achieve our mission, we’re seeking a very specific candidate. We want someone who is passionate about our mission and who believes in the power of crypto and blockchain technology to update the financial system. We want someone who is eager to leave their mark on the world, who relishes the pressure and privilege of working with high caliber colleagues, and who actively seeks feedback to keep leveling up. We want someone who will run towards, not away from, solving the company’s hardest problems. Our work culture is intense and isn’t for everyone. But if you want to build the future alongside others who excel in their disciplines and expect the same from you, there’s no better place to be. While many roles at Coinbase are remote-first, we are not remote-only. In-person participation is required throughout the year. Team and company-wide offsites are held multiple times annually to foster collaboration, connection, and alignment. Attendance is expected and fully supported. The Analytics Engineering team bridges the gap between data engineering, data science, and business analytics by building scalable, impactful data solutions. We transform raw data into actionable insights through robust pipelines, well-designed data models, and tools that empower stakeholders across the organization to make data-driven decisions. Our team combines technical expertise with a deep understanding of the business to unlock the full potential of our data. We prioritize data quality, reliability, and usability, ensuring stakeholders can rely on our data to drive meaningful outcomes. What We Do: Trusted Data Sources: Develop and maintain foundational data models that serve as the single source of truth for analytics across the organization. Actionable Insights: Empower stakeholders by translating business requirements into scalable data models, dashboards, and tools. Cross-Functional Collaboration: Partner with engineering, data science, product, and business teams to ensure alignment on priorities and data solutions. Scalable Data Products: Build frameworks, tools, and workflows that maximize efficiency for data users, while maintaining high standards of data quality and performance. Outcome-Focused Solutions: Use modern development and analytics tools to deliver value quickly, while ensuring long-term maintainability. What you’ll be doing: Analytics engineer is a hybrid Data Engineer/Data Scientist/Business Analyst role that has the expertise to understand data flows end to end, and the engineering toolkit to extract the most value out of it indirectly (building tables) or directly (solving problems, delivering insights). Be the expert: Quickly build subject matter expertise in a specific business area and data domain. Understand the data flows from creation, ingestion, transformation, and delivery. Examples: Step into a new line of business and work with Engineering and Product partners to deliver first data pipelines and insights. Communicate with engineering teams to fix data gaps for downstream data users. Take initiative and accountability for fixing issues anywhere in the stack. Generate business value: Interface with stakeholders on data and product teams to deliver the most commercial value from data (directly or indirectly). Examples: Build out a new data model allowing multiple downstream DS teams to more easily unlock business value through experimentation and ad hoc analysis. Combine Eng details of the algo engine with stats and data expertise to come up with feasible solutions for Eng to make the algo better. Work with PMs to tie together new x-PG, and x-Product data into one holistic framework to optimize key financing product business metrics. Focus on outcomes not tools: Use a variety of frameworks and paradigms to identify the best-fit tools to deliver value. Examples: Develop new abstractions (e.g. UDFs, Python packages, dashboards) to support scalable data workflows/infra. Stand up a framework for building data apps internally, enabling other DS teams to quickly add value. Use established tools with mastery (e.g. Google Sheets, SQL) to quickly deliver impact when speed is top priority. What We Look For in You: In addition to out of the box thinking, attention to detail, a sense of urgency and a high degree of autonomy and accountability, we expect you to have the following skills: Data Modeling Expertise: Strong understanding of best practices for designing modular and reusable data models (e.g., star schemas, snowflake schemas). Prompt Design and Engineering: Expertise in prompt engineering and design for LLMs (e.g., GPT), including creating, refining, and optimizing prompts to improve response accuracy, relevance, and performance for internal tools and use cases. Advanced SQL: Proficiency in advanced SQL techniques for data transformation, querying, and optimization. Intermediate to Advanced Python: Expertise in scripting and automation, with experience in Object-Oriented Programming (OOP) and building scalable frameworks. Collaboration and Communication: Strong ability to translate technical concepts into business value for cross-functional stakeholders. Proven ability to manage projects and communicate effectively across teams. Data Pipeline Development: Experience building, maintaining, and optimizing ETL/ELT pipelines, using modern tools like dbt, Airflow, or similar. Data Visualization: Proficiency in building polished dashboards using tools like Looker, Tableau, Superset, or Python visualization libraries (Matplotlib, Plotly). Development Tools: Familiarity with version control (GitHub), CI/CD, and modern development workflows. Data Architecture: Knowledge of modern data lake/warehouse architectures (e.g., Snowflake, Databricks) and transformation frameworks. Business Acumen: Ability to understand and address business challenges through analytics engineering. Data savvy: Familiarity with statistics and probability. Bonus Skills: Experience with cloud platforms (e.g., AWS, GCP). Familiarity with Docker or Kubernetes. Disclaimer: Applying for a specific role does not guarantee consideration for that exact position. Leveling and team matching are assessed throughout the interview process.",
          "application_url": "https://www.coinbase.com/en-ca/careers/positions/6884049?gh_jid=6884049&gh_src=20687b321us&source=LinkedIn",
          "status": "Not Applied",
          "sentiment": "Neutral",
          "notes": "",
          "date_added": "2025-06-26 13:35:38",
          "location": "Canada",
          "salary": "$191,000—$191,000 CAD",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 24,
          "company_name": "Spiral Scout",
          "job_title": "AI Engineer",
          "job_description": "Spiral Scout is a full-service software development company dedicated to transforming innovative ideas into digital realities. With our talented team and a global presence, including remote offices across Europe, we pride ourselves on delivering over 460 projects worldwide. Our comprehensive services range from IT staff augmentation and bespoke web development to cutting-edge web and mobile design, all tailored to meet the unique needs of each client. We are looking for a systems thinker with hands-on experience in AI tools and workflow automation. In this role, you will design intelligent, agent-driven systems that combine human input with synthetic intelligence to solve real business problems. You will break down complex workflows into discrete, automatable steps, identify where human input is needed, and build efficient multi-agent processes. ... Stakeholder Communication: Comfortable leading workshops or scoping sessions with clients and team members. Nice To Have Familiarity with agent-based frameworks, no-code/low-code prototyping, or platforms like Zapier, Airtable, n8n, and custom GPTs. Designed human-in-the-loop workflows (e.g., content, onboarding, quoting, project management, customer support). Experimented with synthetic user testing or feedback agents.",
          "application_url": "https://spiralscout.bamboohr.com/careers/136",
          "status": "Rejected",
          "sentiment": "Neutral",
          "notes": "Referred by Cole",
          "date_added": "2025-06-26 13:36:10",
          "location": "Remote",
          "salary": "Not specified",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 25,
          "company_name": "Honeycomb",
          "job_title": "Data Engineer",
          "job_description": "We’re growing our Data team, and this role is a foundational part of that growth. You’ll be our second Data Engineer, focused on expanding our data modeling layer, building trustworthy foundations for analytics, and enabling teams across the company—from Product to GTM to Finance—with scalable, reliable data. This role will report directly to the Head of Data and you’ll partner with them and our Staff Data Engineer to build a reliable data foundation upon which Honeycomb can scale our business. You’ll help build the data foundation for a high-velocity startup with strong product-market fit and cross-functional data demand. You’ll be joining early, shaping the standards and structure for our future data practice. You’ll work closely with a technical Head of Data and Staff Data Engineer—not abstract stakeholders—and have clear lines of ownership. You’ll have the opportunity to explore generative AI, LLMs, and agent workflows where they make sense (e.g., schema mapping, anomaly detection, code validation). You’ll ship things that matter, fast—but thoughtfully. What you’ll do in the role: Own and expand our dbt modeling layer, ensuring it is structured, documented, and reliable. Ingest and normalize data from diverse systems (e.g. Stripe, Salesforce, Hubspot, Netsuite) via Fivetran and custom pipelines. Collaborate with stakeholders across the business to understand how data is used and what it needs to represent. Build analysis-ready marts that power dashboards, experimentation, and planning. Partner with our Staff Data Engineer on ingestion architecture and orchestration, while taking the lead on modeling and semantic logic. Ensure data quality via testing, validation frameworks, and proactively identifying upstream issues. Create leverage through documentation, code reusability, and adoption of AI-assisted tooling to boost development velocity, reduce manual overhead, and enhance documentation/testing. What you’ll bring to the role: 3–5+ years of experience in data engineering or analytics engineering. Mastery of SQL and dbt, with an eye for structure, testing, and maintainability. Working experience with Python, especially for data ingestion, orchestration, and basic scripting. Comfort working with cloud data warehouses like Snowflake (or Redshift, BigQuery). Comfort working through ambiguous situations - our data team is small and young so some role shaping and willingness to work across the data stack (e.g. occasional dashboard building, analysis) is critical to early success in this role. Experience implementing structured data models, architectures and marts. Strong intuition around data contracts, late-arriving data, slowly changing dimensions, and business logic edge cases. Strong intuition around data quality and governance including experience developing tests and building out documentation. Experience working across functions (e.g., Finance, Product, CS) to map business needs into durable models. Hands-on usage of AI tooling in your data engineering workflow (e.g., Copilot for dbt model stubs, AI-assisted test generation, documentation, SQL generation/refactoring, or code reviews)—you don’t just use it, you use it thoughtfully to create leverage. A mindset of ownership, iteration, and clarity—you care about the business logic behind the data, and building systems others can trust and build on.",
          "application_url": "https://job-boards.greenhouse.io/honeycomb/jobs/4785509008?gh_src=406906b58us",
          "status": "Not Applied",
          "sentiment": "Neutral",
          "notes": "High salary - ideal fit",
          "date_added": "2025-07-04 18:59:53",
          "location": "Remote",
          "salary": "$218,200 - $256,700 CAD",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 26,
          "company_name": "KOHO",
          "job_title": "Senior Data Analyst",
          "job_description": "At KOHO, our Senior Data Analysts are strategic partners who transform raw information into actionable business impact. We're seeking an experienced analyst who thrives at the intersection of technical expertise and marketing strategy to join our data team. In this role, you'll own the marketing analytics domain within our fintech ecosystem, turning complex marketing data into pipelines and clear narratives that drive decision-making at all levels. The ideal candidate is both technically proficient and marketing-savvy, equally comfortable optimizing a complex SQL query as they are presenting campaign insights to marketing teams. What You'll Do: Own the marketing analytics domain: integrating data requirements into project planning, collaborate with marketing teams and cross-functional partners, building pipelines and dashboards for campaign analysis, customer acquisition, and marketing performance measurement. Design and optimize data models with a strong focus on performance, leveraging advanced DBT features independently. Develop dashboards that go beyond visualization to answer critical business questions and support strategic decision-making. Analyze marketing campaign performance, measure program effectiveness, support audience creation initiatives, and provide insights across various marketing channels and initiatives. Proactively identify trends and opportunities through deep data analysis, thinking beyond immediate requests to uncover additional relevant insights. Partner with stakeholders to refine requirements, offering data-driven recommendations that align with business priorities and maximize impact. Autonomously own project planning and participate in cross-functional domain ownership. Mentor team members and contribute to establishing best practices within the data organization.",
          "application_url": "https://jobs.ashbyhq.com/koho/5fa140cd-ec01-4064-a2da-0bca55f31351?utm_source=LinkedInPaid",
          "status": "Rejected",
          "sentiment": "Neutral",
          "notes": "Remote in Canada",
          "date_added": "2025-07-21 16:29:25",
          "location": "Remote",
          "salary": "CA$85K – CA$115K per year",
          "applied_date": "2025-07-21",
          "user_id": 8
        },
        {
          "id": 27,
          "company_name": "Liftoff",
          "job_title": "Senior Analytics Engineer",
          "job_description": "Liftoff is a leading AI-powered performance marketing platform for the mobile app economy. Our end-to-end technology stack helps app marketers acquire and retain high-value users, while enabling publishers to maximize revenue across programmatic and direct demand.\n\nLiftoff’s solutions, including Accelerate, Direct, Monetize, Intelligence, and Vungle Exchange, support over 6,600 mobile businesses across 74 countries in sectors such as gaming, social, finance, ecommerce, and entertainment. Founded in 2012 and headquartered in Redwood City, CA, Liftoff has a diverse, global presence.\n\nAnalytics Engineers bridge the gap between data engineering and data analysis, focusing on transforming raw data into clean, structured, and accessible datasets that empower stakeholders to make data-driven decisions. Their role combines technical expertise, collaboration, and software engineering best practices to ensure reliable and scalable analytics systems. Analytics Engineers commercial, finance, platform, and R&D teams with trusted, high-quality data to drive business decisions at speed.\n\nResponsibilities\nDesign and maintain efficient data models for company-wide analysis, collaborating closely with business users.\nDevelop user-facing data products using SQL and analytics on core infrastructure managed by the Data Engineering team.\nOptimize and improve Liftoff's Looker-based BI layer to scale and meet business needs.\nIndependently complete tasks, managing your priorities and contributing to larger projects with minimal supervision.\nWrite clean, maintainable code and participate in code reviews, following best practices (e.g., version control, CI/CD) to ensure quality and scalability.\nIdentify and resolve technical debt, improving team productivity and project health.\nMaintain and troubleshoot data pipelines, ensuring reliable operation.\nCollaborate with users to optimize queries, design aggregations, and suggest performance improvements.\nEnsure high-quality work that meets security, reliability, and privacy standards.\nQualifications\n5+ years of experience with SQL, including expertise in writing efficient, optimized queries.\nStrong experience with Data Analytics and a solid understanding of query plans and data model optimization.\n2+ years of experience with Looker, including developing user-facing dashboards, reports, and complex data models.\nExperience with DBT, Rill, and Looker for data modeling and BI tools.\nProficiency in Python for data analysis, automation, and integrating with data workflows, along with a solid understanding of data structures and algorithms for writing efficient code.\nFamiliarity with big data technologies like Trino, Apache Spark, or Databricks, and a strong understanding of distributed data processing principles, including execution plans, join strategies, and large-scale query execution, with the ability to optimize performance.\nExcellent communication skills and experience collaborating with different teams to understand requirements.\nNice to Have\nExperience in ad-tech.\nKnowledge of AgroCD, Kubernetes, AWS, and Github.\nExperience with a second programming language (especially Scala).\nFamiliarity with machine learning workflows.\nLocation:\nThis role is eligible for full-time remote work in Canada. We prefer for this role to be based in the Pacific Time Zone.\n\nTravel Expectations:\nWe offer several opportunities for in-person team gatherings, including but not limited to project meetings, regional meetups, and company-wide events. We expect our employees to attend these gatherings at least once per quarter. These gatherings provide essential opportunities for collaboration, communication, and team building.\n\nThis role is required to travel (internationally from Canada) a minimum of 1 week per quarter of planning meetings and other work events.\n\nCompensation:\nLiftoff offers all employees a full compensation package that includes equity and health/vision/dental benefits associated with your country of residence. Base compensation will vary based on the candidate's location and experience.\n\nThe following are our annual salary ranges for this role: \n\nCanada: 130,000-150,000 CAD",
          "application_url": "https://liftoff.io/job/?gh_jid=7011947&gh_src=b63f44861us",
          "status": "Rejected",
          "sentiment": "Positive",
          "notes": "",
          "date_added": "2025-07-21 16:38:19",
          "location": "Remote, Canada",
          "salary": "130000 - 150000",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 32,
          "company_name": "RBC",
          "job_title": "Lead Strategy Specialist",
          "job_description": "This Lead Strategy Specialist within the Wealth Management Technology (WMT) team will play a key role in driving strategic alignment and collaboration between the business and technology teams. This is an exciting opportunity to leverage your strategic expertise, industry knowledge, and leadership skills to make a significant impact on our organization's success. You will be responsible for understanding business strategy and engaging in the strategy development process to ensure overarching alignment to the technology delivery approach, target architecture, and strategic technology principles. You will partner with stakeholders of all levels, across multiple functions, to help shape the technology strategy, driving increased productivity, technical advancement, and execution excellence in line with overarching enterprise objectives. Additionally, you will be responsible for enabling an innovation and engineering-based culture with a focus on increased employee engagement, satisfaction, and growth. Partner to develop and evolve the WMT strategy in alignment with WM business and enterprise perspective/priorities, supported by materials that ensure strategic priorities are clearly understood across the team including clearly defining what success looks like. Partner with internal and external teams to build a strategic roadmap of short- & long-term initiatives that drive WMT strategic OKRs, including ongoing monitoring and reporting of performance metrics and insights. Engage in the WM business strategy development and evolution processes to gain a deep understanding of business direction and objectives, while ensuring alignment to technology principals and providing overarching insight across multiple segments/geographies. Apply thought-leadership, providing insight-driven solutions and developing recommendations for Senior Leaders and Executives that identify high impact strategies, opportunities, and action plans to transform the way we work. Create business cases that highlight opportunities for technology enhancement / investment that foster innovation, scalability and efficiency. Support the development and execution of a comprehensive talent strategy to drive a future-ready workforce, aligning with business objectives and ensuring the technology team can identify, attract, and retain the necessary skills to support Wealth Management business goals. Drive the adoption of innovative practices and technologies, encouraging experimentation, calculated risk-taking, and a culture of continuous improvement within the team. Acts as a champion of the strategy. Working with our pillar leads to drive change management and activation of our strategy within their teams. Be a cross-functional team player, engaging with a wide range of stakeholders across multiple geographies and seniority levels. Must-have: MBA or +8 years’ experience in strategy development and execution. Consultative Leadership approach with proven ability to engage with stakeholders at all levels, including our senior executives, to understand needs and translate that into action managing change and fostering organizational alignment through impact and influence. History of making an impact, developing, and executing on strategies and delivering superior results in both the short and long term with a demonstrated ability to identify and act upon opportunities. Capable of diving deep, from both a quantitative and qualitative standpoint, and translating complex findings into clear, impactful insights and recommendations for senior executive audiences. A strategic and innovative thinker with strong organizational skills and attention to detail. A proactive self-starter with a hands-on mentality who thrives in a fast-paced environment quickly adapts to changing priorities and rapidly grasps new concepts. Strong verbal and non-verbal communication skills, with a proven track record of creating strategic communications and content that are high quality, concise and effective for both executive and non-executive audiences; with excellent technical ability with PowerPoint. Nice-to-have: Change management training, certification and/or experience. Experience within the financial services industry. Global awareness of emerging technical capabilities. Experience in project and program management. Experience with data analytics tools and data visualization tools. Experience with agile ways of working. Job Skills: Commercial Acumen, Communication, Critical Thinking, Decision Making, Group Problem Solving, Long Term Planning, Negotiation, Organizational Change Management, Professional Presentation.",
          "application_url": "https://jobs.rbc.com/ca/en/job/RBCAA0088R0000129267EXTERNALENCA/Lead-Strategy-Specialist?utm_source=LinkedIn&utm_medium=phenom-feeds&utm_campaign=rbc_linkedin",
          "status": "Rejected",
          "sentiment": "Neutral",
          "notes": "",
          "date_added": "2025-07-24 11:41:03",
          "location": "Toronto, Canada",
          "salary": "Not specified",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 33,
          "company_name": "LunaJoy Health",
          "job_title": "Senior Data Analyst / Data Architect",
          "job_description": "Skills: SQL, ETL, Data Analytics\nJob Title: Senior Data Analyst / Data Architect\nDepartment: Product\nReports to: Data Scientist\n\nAs a Senior Data Analyst & Data Architect, you will play a dual role in leading high-level machine learning initiatives while architecting scalable, secure, and efficient data ecosystems. This is a strategic role ideal for a hands-on leader who is equally comfortable with modeling, analytics, cloud engineering, and stakeholder collaboration.\nWe are specifically looking for someone trained in the U.S. or with strong U.S. enterprise experience, and who understands how to build data systems that support global operations.\nAs part of the Luna Joy team, you will play an essential role in directly contributing to supporting the mental health journey of one million women with purpose-driven innovation, unwavering compassion, and transformative care. You will need speed to adapt quickly and efficiently, and the drive to be 1% better every day, constantly striving for improvement. Additionally, you will demonstrate compassion and contribute to a positive work environment by giving and getting joy in your daily interactions. These values will enable you to effectively contribute to important areas of focus and responsibility.\n\nKey Responsibilities:\nArchitect end-to-end data platforms, integrating structured and unstructured data across multiple sources and environments (cloud, on-premise, APIs, etc.)\nLead development and deployment of machine learning models that directly impact business outcomes (predictive analytics, personalization, risk scoring, NLP, etc.)\nCollaborate with product, engineering, and business teams to translate strategic objectives into scalable data solutions\nEstablish data governance, security, and compliance best practices\nOptimize data storage, processing, and retrieval using technologies such as Snowflake, Redshift, BigQuery, or similar\nDesign and implement ETL/ELT pipelines, real-time data streams, and ML pipelines\n\nQualifications:\n5+ years of experience in data science, machine learning, and data architecture\nDeep expertise in Python, SQL, and at least one other language (e.g., R, Scala, or Java)\nStrong hands-on experience with data warehousing, cloud platforms (AWS, GCP, or Azure), and orchestration tools (Airflow, Prefect)\nProven experience in deploying ML models in production environments (MLOps, Docker, CI/CD pipelines)\nAdvanced degree in Computer Science, Data Science, Engineering, or a related field (PhD or MS preferred)\nFamiliarity with US regulatory frameworks (HIPAA.) and industry standards\nStrong communication and leadership skills; ability to engage both technical and non-technical stakeholders\n\nNice to Have:\nExperience with data products in healthcare, finance, or consumer applications\nUS work experience or training from a U.S. institution (academic or corporate)\nFamiliarity with LATAM market data infrastructure challenges and compliance landscape\nExperience leading data teams in a high-growth, remote-first environment.",
          "application_url": "https://www.workatastartup.com/jobs/74021",
          "status": "Not Applied",
          "sentiment": "Neutral",
          "notes": "YCombinator role",
          "date_added": "2025-07-24 18:57:43",
          "location": "Remote",
          "salary": "$1.5K - $2K",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 34,
          "company_name": "SPECTRAFORCE",
          "job_title": "Data Analytics Enginer",
          "job_description": "About the job\nTitle: Sr Data Analyst\n\nDuration: 12+ Months\n\nLocation: 100% remote in Canada\n\nCore hours 9-5 EST\n\n\n\nRole Summary\n\nVirtual and augmented reality are transforming design and creation through new immersive and collaborative experiences that will impact how major segments like entertainment, architecture, engineering, construction, and manufacturing converge.\nThe industry is being transformed by XR technology growth, creating new ways of working to review, collaborate and create.\nAs a Data Analyst, you help teams make smarter, more informed decisions by turning raw data into clear, actionable insights.\nYou’ll collect, clean, and analyze data, build reports and dashboards, and support ongoing business questions with timely, accurate analysis.\nIn this role, you’ll work closely with experienced analysts and cross-functional teams, building your technical skills and learning best practices along the way.\n\n\nKey Responsibilities\n\nBuild and maintain dashboards for various teams (Sales, Customer Success, Marketing, Product, etc.)\nExecute ad-hoc reporting requests and exploratory user behavior analysis\nTake ownership of data pipelines, from data ingestion to data modeling to analytics.\nLead the design, build, test, and release of solutions to generate insight from a variety of data sources.\nCollaborate with stakeholders to gather requirements and deliver actionable insights\nBreak down high-level requirements into comprehensive epics and smaller tasks that can be easily managed and tracked.\nOrganize and maintain a Jira backlog, ensuring that epics and tasks are clearly defined, prioritized, and updated regularly.\nLead sprint planning.\nEnsure data accuracy, consistency, and integrity by following best practices in data collection, cleaning, and analysis, allowing for high-quality insights. Identify and resolve data discrepancies as needed.\nMentor and support junior analysts by providing technical guidance, sharing best practices, and fostering a culture of continuous learning within the team\nEnsure documentation is kept up to date with any changes or enhancements to data engineering processes, workflows, and systems.\n\n\nMinimum Requirements\n\n5 years of relevant industry experience in big data systems, data processing, and SQL databases.\n3+ years of hands-on programming skills, able to write modular, maintainable code, preferably in Python\nStrong understanding of SQL, dimensional modeling, and analytical big data warehouses like Hive and Snowflake.\nBI Tools: Experience with Power BI for dashboard creation and sharing insights\nData Stack Exposure: Familiarity with Snowflake, DBT, Fivetran, and Airflow (hands-on experience is a plus, but can be learned on the job)\nExperience with Product Analytics\nStrong technical skills and interest in learning best of class technologies around data warehousing, data wrangling, and data quality.\nAbility to manage multiple projects simultaneously and prioritize tasks effectively.\nStrong communication & collaboration skills.\n\n\nAre there any technical tools/applications you would like the candidates to be proficient with.\n\nBI Tools: Experience with Power BI for dashboard creation and sharing insights\nData Stack Exposure: Familiarity with Snowflake, DBT, Fivetran, and Airflow (hands-on experience is a plus, but can be learned on the job)\n\n\nWhat are the 3 \"must haves\" on the resume?\n\n5 years of relevant industry experience in big data systems, data processing, and SQL databases.\n3+ years of hands-on programming skills, able to write modular, maintainable code, preferably in Python\nStrong understanding of SQL, dimensional modeling, and analytical big data warehouses like Hive and Snowflake.",
          "application_url": "https://www.linkedin.com/jobs/view/4274773240/?refId=kJOfigrfRiq%2BROmhqJkR%2Bw%3D%3D&trackingId=4T2fO0qqRB6s8t%2Bnvldfqg%3D%3D",
          "status": "Not Applied",
          "sentiment": "Neutral",
          "notes": "",
          "date_added": "2025-07-25 14:27:59",
          "location": "Remote, Canada",
          "salary": "Not specified",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 35,
          "company_name": "Upwork",
          "job_title": "AI Web Scraper Development for Data Parsing and Merging",
          "job_description": "We are seeking a highly skilled and motivated developer to join our dynamic team in creating an innovative AI web scraper that is capable of automatically parsing, collecting, and merging data from a wide variety of websites across the internet. This is an exciting opportunity for someone who is passionate about data technology and has a keen interest in artificial intelligence applications within the realm of web scraping.\n\nThe ideal candidate will possess significant experience in web scraping technologies, including but not limited to libraries and frameworks such as Beautiful Soup, Scrapy, Selenium, and others. A solid understanding of data integration techniques is also essential, as you will be tasked with designing robust solutions that not only extract information from disparate sources but also harmonize and unify that data into a cohesive format for further analysis.\n\nIn this role, you will be responsible for the entire lifecycle of the scraping process. This includes researching and identifying target websites, developing algorithms for efficient data extraction, and implementing methods to ensure the accuracy of the collected information. You will also need to stay informed about and adhere to website policies and terms of service to ensure compliance with legal and ethical standards in data collection.\n\nAdditionally, the role requires you to implement error handling and recovery mechanisms to deal with potential disruptions during the scraping process. You will collaborate with cross-functional teams to understand data requirements, develop data models, and integrate the scraped data into existing databases or applications, ensuring that the output meets the needs of our stakeholders.\n\nWe are looking for someone who is not only technically proficient but also has strong problem-solving skills and the ability to think critically about complex data challenges. If you possess the required skills, have a passion for tackling challenging data projects, and are eager to work in a fast-paced and collaborative environment, we would love to hear from you! This position offers the potential for growth and learning, as well as the chance to be part of a cutting-edge project that leverages the latest advancements in AI and data technology.\n\nJoin us and become a key player in revolutionizing the way we gather and utilize data from the web! We look forward to receiving your application and discussing how you can contribute to our exciting journey.",
          "application_url": "https://www.upwork.com/nx/proposals/job/~021949924765484798726/apply/",
          "status": "Applied",
          "sentiment": "Neutral",
          "notes": "Need to submit a proposal",
          "date_added": "2025-07-29 16:55:19",
          "location": "Remote",
          "salary": "60 per hour",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 36,
          "company_name": "KOHO",
          "job_title": "Analytics Engineer",
          "job_description": "We're seeking an Analytics Engineer to build robust analytics infrastructure and lead large-scale data platform projects at KOHO. This is your opportunity to make a significant impact using cutting-edge technology and AI! Your Mission 🎯 You'll lead large, multi-month analytics infrastructure projects including: Monitoring and optimizing complex DBT job structures across multiple domains Designing multi-domain marts following various modeling frameworks (one big table, entity tables, Kimball, data mesh) Developing complex metrics on big datasets using DBT and the DBT semantic layer Using DBT Core for development and DBT Cloud for orchestration while applying software engineering best practices Productizing new technology workflows and training the team to use them Monitoring and optimizing AWS Redshift warehouse performance Building automated data quality monitoring with tools like Elementary Creating scalable, self-service analytics infrastructure Technical Excellence You'll Bring 💡 3+ years of experience in data manipulation and analytics architecture Advanced expertise in DBT (incremental modeling, materializations, snapshots, variables, macros, jinja) Strong SQL skills and query optimization experience Experience with AWS Redshift, DBT Core, DBT Cloud, and DBT semantic layer Proficiency with VS Code and modern development workflows Strong opinions and practical experience leveraging AI tools like Claude for code development What Sets You Apart 🌟 You're passionate about building robust, scalable systems You thrive on automation and continuous improvement You have experience delivering large, complex technical projects You're excited about integrating AI technology for competitive advantages The KOHO Analytics Engineering Vision 🔮 We're building the future of data accessibility and reliability powered by AI. Our mission is to deliver a unified source of truth that empowers every team member to make data-driven decisions. We value: Enablement over control Scalability over quick fixes Agility over perfection AI-first innovation Ready to Transform Data Analytics? Join us in revolutionizing data infrastructure with AI-powered workflows. Your expertise will directly impact millions of users while working with cutting-edge technologies.",
          "application_url": "https://jobs.ashbyhq.com/koho/2fb68c54-91ab-4d74-bf33-87c428e97a77?utm_source=LinkedInPaid",
          "status": "Applied",
          "sentiment": "Neutral",
          "notes": "",
          "date_added": "2025-07-29 19:26:52",
          "location": "Remote, Canada",
          "salary": "CA$110K - CA$165K per year",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 37,
          "company_name": "Lululemon",
          "job_title": "Data Scientist",
          "job_description": "who we are\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth-focused environment for our people.\n\nabout this team\nThe retail planning and analytics team’s purpose is to drive exceptional performance through actionable plans and insights; empowering people to unlock the best experiences in retail. The team is directly responsible for retail sales, labour, and headcount plans in North America and leads the retail reporting and insights function to support stores and SSC leadership.\n a day in the life: what you’ll do\nReporting to the Senior Manager, Global Retail Planning, you will optimize investment across labor, staffing, and service to drive sales, guest experience, and operational efficiency. Using advanced analytics, you will:\nLeverage statistical techniques like regression and cohort analysis, to diagnose drivers of performance and identify patterns, trends, and insights\nDetermine optimal labour levels to achieve lululemon’s long-term strategic goals\nOptimize our labour allocation across stores to maximize sales potential\nDevelop and maintain predictive models using machine learning techniques to forecast store sales, traffic, and other key KPIs\nAct as a thought partner to planning and operations leaders, shaping strategic decisions through proactive insight and scenario modeling\nCommunicate findings and recommendations to technical and non-technical stakeholders\n qualifications\nBachelor’s degree in Mathematics, Statistics, Computer Science, Business Analytics, or related field. Master’s degree a plus.\n5+ years of experience in data science, or analytical role, with a focus on complex data analysis\nStrong background in mathematics with a strong foundation in statistics and regression analysis\nProficiency in programming languages including SQL, Python, R.\nStrong analytical and problem-solving skills with the ability to handle large data sets\nProven ability to lead cross-functional projects and collaborate effectively with excellent verbal and written communication skills\n must haves\nAcknowledge the presence of choice in every moment and take personal responsibility for your life.\nPossess an entrepreneurial spirit and continuously innovate to achieve great results. \nCommunicate with honesty and kindness and create the space for others to do the same. \nLead with courage, knowing the possibility of greatness is bigger than the fear of failure. \nFoster connection by putting people first and building trusting relationships. \nIntegrate fun and joy as a way of being and working, aka doesn’t take yourself too seriously.",
          "application_url": "https://careers.lululemon.com/en_US/careers/JobDetail/Data-Scientist/49722",
          "status": "Applied",
          "sentiment": "Neutral",
          "notes": "",
          "date_added": "2025-07-30 15:41:48",
          "location": "Vancouver, Canada",
          "salary": "$105,800 - $138,800 annually",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 38,
          "company_name": "Upwork",
          "job_title": "AI Automation Specialist Needed for Innovative Projects",
          "job_description": "We are seeking an AI Automation Specialist to help streamline our processes and enhance productivity through innovative automation solutions. The ideal candidate will have experience in designing, implementing, and optimizing AI-driven automation tools. You will be responsible for analyzing current workflows, identifying automation opportunities, and deploying AI solutions. If you are passionate about improving efficiency and have a strong understanding of AI technologies, we would love to hear from you!",
          "application_url": "https://www.upwork.com/jobs/~021950412651143057763",
          "status": "Applied",
          "sentiment": "Negative",
          "notes": "Low pay",
          "date_added": "2025-07-30 15:44:30",
          "location": "Remote",
          "salary": "40 per hour",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 39,
          "company_name": "Oscilar",
          "job_title": "Sr./Staff Data Scientist",
          "job_description": "As a Data Scientist at Oscilar, you will be responsible for developing and implementing advanced fraud detection models to protect our customers’ business from fraudulent activities. As an early member in the ML team you will have great impact in building out our ML stack.\nResponsibilities:\nDevelop and implement advanced fraud detection models, leveraging machine learning and statistical techniques, to identify and prevent fraudulent activities across our platform.\nCollaborate with cross-functional teams, including engineering, product, and operations, to design and implement fraud detection systems and processes.\nAnalyze large volumes of data to identify patterns, trends, and anomalies indicative of fraudulent behavior, and develop data-driven insights to improve fraud prevention strategies.\nEvaluate the performance of existing fraud detection models and systems, and continuously optimize and update them to adapt to changing fraud trends and tactics.\nStay up-to-date with the latest trends and advancements in fraud detection, data science, and machine learning, and apply this knowledge to enhance our fraud prevention capabilities.\nCommunicate complex data analysis and model performance results to both technical and non-technical stakeholders, driving data-driven decision-making across the organization.\nEnsure data privacy and security compliance in all aspects of fraud detection and data analysis.\nRequirements:\n3+ years of experience in data science, machine learning, or a related field, with a focus on fraud prevention and/or anti-money laundering.\nProficiency in Python.\nFluency in cloud development (AWS, GCP, Azure, etc.) and MLOps is a plus.\nStrong knowledge of machine learning algorithms and statistical techniques, with a focus on their application in fraud detection.\nExperience working with large datasets using distributed systems like Apache Spark and Dask, handling data-related challenges such as data cleaning, data quality, and data transformation and feature engineering at scale.\nExcellent analytical and problem-solving skills, with the ability to derive actionable insights from complex data.\nStrong communication skills, with the ability to explain complex concepts and findings to both technical and non-technical audiences.\nAbility to work independently and collaboratively in a fast-paced, dynamic startup environment.\nPreferred Qualifications:\nExperience in the fintech, marketplaces, or financial services industry.\nKnowledge of current fraud tactics and trends, as well as experience with fraud detection tools and systems.",
          "application_url": "https://jobs.ashbyhq.com/oscilar/a83cfe5b-5a34-4aa7-9e4d-52ca6428efc6?utm_source=LinkedInPaid",
          "status": "Not Applied",
          "sentiment": "Neutral",
          "notes": "",
          "date_added": "2025-07-30 16:29:03",
          "location": "Remote - United States, Remote - Canada",
          "salary": "Competitive salary and equity packages, including a 401k",
          "applied_date": null,
          "user_id": 8
        },
        {
          "id": 40,
          "company_name": "StackAdapt",
          "job_title": "SeniorBI Data Analyst",
          "job_description": "StackAdapt is the leading technology company that empowers marketers to reach, engage, and convert audiences with precision. With 465 billion automated optimizations per second, the AI-powered StackAdapt Marketing Platform seamlessly connects brand and performance marketing to drive measurable results across the entire customer journey. The most forward-thinking marketers choose StackAdapt to orchestrate high-impact campaigns across programmatic advertising and marketing channels.\n\nBased out of our Toronto office, you will be part of the Programmatic Partnerships & Business Solutions Team. As the Senior Data Analyst, you will provide quantitative analyses, market & industry expertise, and strategic recommendations to cross-functional teams within StackAdapt. You will articulate business questions, pulling numbers from multiple & large datasets to provide meaningful business insights and become a subject-matter expert on programmatic landscape and supply-side dynamics.\n\nWhat You'll Be Doing:\n\nDesign and implementation of automated, scalable reporting infrastructure and analytics solutions.\nDesign and build data pipelines and Dashboards collaborating with other Analysts on the team.\nContinuously and meticulously monitor, report & review business metrics and supply quality with internal stakeholders translating data into actionable prescriptive insights and recommendations.\nExecute projects collaborating with internal stakeholders, providing insights and customized KPIs to support decision-making and strategic planning.\nPerform deep-dive analysis to understand trends, and anomalies, and provide actionable recommendations to stakeholders, define technical requirements for data processes, and design high-quality visualizations and reports.\nPartner closely with Inventory & Data Partnerships, Product Solutions, Platform Quality, Marketing, Engineering teams, etc and work cross-functionally on data analysis providing meaningful and strategic recommendations to teams.\n\nWhat You'll Bring To The Table\n\nStrong knowledge and experience scripting with SQL and Python, extracting insights from large sets of data.\nExperience with Snowflake, BigQuery, Redshift, etc \nExperience with data visualization tools (Tableau, Qlik, Looker, etc).\nPrior experience working in Business intelligence/Data/Analytics teams and/or platforms building predictive data & analytics solutions.\nBachelor’s or Master’s degree in a quantitative field, with a proven academic track record (e.g., finance, economics, statistics, math, etc.).\nMinimum 2+ years of working experience in a quantitative or analytics-driven environment with solid understanding of statistical techniques.\nStrong verbal and written communication skills, comfortable presenting detailed technical and statistical analyses to senior stakeholders.\n\nStackAdapter's Enjoy:\n\nOptional global WeWork membership for those who want a change from their home office\nRobust training and onboarding program\nAccess to StackAdapt programmatic courses and certifications to support continuous learning\nA friendly, welcoming, and supportive culture\nOur social and team events!\n\nStackAdapt is a diverse and inclusive team of collaborative, hardworking individuals trying to make a dent in the universe. No matter who you are, where you are from, who you love, follow in faith, disability (or superpower) status, ethnicity, or the gender you identify with (if you’re comfortable, let us know your pronouns), you are welcome at StackAdapt. If you have any requests or requirements to support you throughout any part of the interview process, please let our Talent team know.\n\nAbout StackAdapt\n\nWe've been recognized for our diverse and supportive workplace, high performing campaigns, award-winning customer service, and innovation. We've been awarded:\n\nAd Age Best Places to Work 2024\n\nG2 Top Software and Top Marketing and Advertising Product for 2024\n\nCampaign’s Best Places to Work 2023 for the UK\n\n2024 Best Workplaces for Women and in Canada by Great Place to Work®\n\n#1 DSP on G2 and leader in a number of categories including Cross-Channel Advertising\n",
          "application_url": "https://www.linkedin.com/jobs/view/4226289557/?alternateChannel=search&refId=72bvn0j7OO4Jlxc4oponig%3D%3D&trackingId=y%2BYwY4HO2gYamIRPGx4tCA%3D%3D",
          "status": "Rejected",
          "sentiment": "Neutral",
          "notes": "",
          "date_added": "2025-07-30 16:47:40",
          "location": "Remote, Canada",
          "salary": "Not specified",
          "applied_date": null,
          "user_id": 8
        }
      ]
    },
    "documents": {
      "count": 7,
      "data": [
        {
          "id": 1,
          "document_name": "Rob Enright Resume May 2025",
          "document_type": "Resume",
          "upload_date": "2025-05-03 15:12:58",
          "file_path": "data/documents/Rob Enright Resume May 2025_20250503_151258_Robert_Enright_Resume_Cleaned.docx",
          "user_id": 8,
          "document_content": null,
          "preferred_resume": 0
        },
        {
          "id": 2,
          "document_name": "Trust Pilot Cover Letter",
          "document_type": "Cover Letter",
          "upload_date": "2025-05-12 18:06:58",
          "file_path": "data/documents/Trust Pilot Cover Letter_20250512_180658_Trust Pilot Cover Letter.docx",
          "user_id": 8,
          "document_content": null,
          "preferred_resume": 0
        },
        {
          "id": 3,
          "document_name": "Spotify Cover Letter",
          "document_type": "Cover Letter",
          "upload_date": "2025-05-13 15:46:36",
          "file_path": "data/documents/Spotify Cover Letter_20250513_154636_Spotify Cover Letter.docx",
          "user_id": 8,
          "document_content": null,
          "preferred_resume": 0
        },
        {
          "id": 4,
          "document_name": "Klarna Cover Letter",
          "document_type": "Cover Letter",
          "upload_date": "2025-05-16 12:59:02",
          "file_path": "data/documents/Klarna Cover Letter_20250516_125902_RobertEnright - Cover Letter Klarna.pdf",
          "user_id": 8,
          "document_content": null,
          "preferred_resume": 0
        },
        {
          "id": 5,
          "document_name": "Resume1",
          "document_type": "Resume",
          "upload_date": "2025-07-22 09:02:19",
          "file_path": "/fake/path/resume1.pdf",
          "user_id": 9,
          "document_content": null,
          "preferred_resume": 0
        },
        {
          "id": 6,
          "document_name": "Resume2",
          "document_type": "Resume",
          "upload_date": "2025-07-22 09:02:19",
          "file_path": "/fake/path/resume2.pdf",
          "user_id": 10,
          "document_content": null,
          "preferred_resume": 0
        },
        {
          "id": 8,
          "document_name": "Rob Formatted Resume July 2025",
          "document_type": "Resume",
          "upload_date": "2025-07-29 18:28:20",
          "file_path": "data/documents/Rob Formatted Resume July 2025_20250729_182820_Robert_Enright_Formated_Resume_July_2025.docx",
          "user_id": 8,
          "document_content": null,
          "preferred_resume": 1
        }
      ]
    },
    "user_profile": {
      "count": 1,
      "data": [
        {
          "id": 1,
          "selected_resume": "Rob Enright Resume May 2025",
          "career_goals": "Test",
          "created_date": "2025-05-03 15:42:21",
          "last_updated_date": "2025-05-03 15:42:21",
          "user_id": 8
        }
      ]
    },
    "career_goals": {
      "count": 6,
      "data": [
        {
          "id": 1,
          "goals": "I am looking for a Senior Data Scientist or Analytics Manager role in the EU or Canada. I am also interested in Research or Sales opportunities in fun industries that could be a good fit for me.\n\nMy interests in life are economics, travel, history, sports, restaurants, bars, movies, books and TV shows. Any roles within these sectors would be a real bonus.  \n\nMoney is not the main driver behind my career. Roles of interest in exciting companies really gets me going. I am always looking to learn and work with folks who are keen to quickly adopt new software, techniques and concepts.\n\nI am both an EU and Canadian citizen, with a preference towards roles in the EU.",
          "submission_date": "2025-05-03 16:05:39",
          "user_id": 8
        },
        {
          "id": 2,
          "goals": "I am looking for a Senior Data Scientist or Analytics Manager role in the EU or Canada. I am also interested in Research or Sales opportunities in fun industries that could be a good fit for me.\n\nMy interests in life are economics, travel, history, sports, restaurants, bars, movies, books and TV shows. Any roles within these sectors would be a real bonus.  \n\nMoney is not the main driver behind my career. Roles of interest in exciting companies really gets me going. I am always looking to learn and work with folks who are keen to quickly adopt new software, techniques and concepts.\n\nI am both an EU and Canadian citizen, with a preference towards roles in the EU. V2",
          "submission_date": "2025-05-03 16:05:55",
          "user_id": 8
        },
        {
          "id": 3,
          "goals": "I am looking for a Senior Data Scientist or Analytics Manager role in the EU or Canada. I am also interested in Research or Sales opportunities in fun industries that could be a good fit for me.\n\nMy interests in life are economics, travel, history, sports, restaurants, bars, movies, books and TV shows. Any roles within these sectors would be a real bonus.  \n\nMoney is not the main driver behind my career. Roles of interest in exciting companies really gets me going. I am always looking to learn and work with folks who are keen to quickly adopt new software, techniques and concepts.\n\nI am both an EU and Canadian citizen, with a preference towards roles in the EU.",
          "submission_date": "2025-05-06 15:21:12",
          "user_id": 8
        },
        {
          "id": 4,
          "goals": "I am looking for a Senior Data Scientist or Analytics Manager role in the EU or Canada. I am also interested in Research or Sales opportunities in fun industries that could be a good fit for me.\n\nMy interests in life are economics, travel, history, sports, restaurants, bars, movies, books and TV shows. Any roles within these sectors would be a real bonus.  \n\nMoney is not the main driver behind my career. Roles of interest in exciting companies really gets me going. I am always looking to learn and work with folks who are keen to quickly adopt new software, techniques and concepts.\n\nI am both an EU and Canadian citizen, with a preference towards roles in the EU. Mark eats ass",
          "submission_date": "2025-05-07 21:08:18",
          "user_id": 8
        },
        {
          "id": 5,
          "goals": "I am looking for a Senior Data Scientist or Analytics Manager role in the EU or Canada. I am also interested in Research or Sales opportunities in fun industries that could be a good fit for me.\n\nMy interests in life are economics, travel, history, sports, restaurants, bars, movies, books and TV shows. Any roles within these sectors would be a real bonus.  \n\nMoney is not the main driver behind my career. Roles of interest in exciting companies really gets me going. I am always looking to learn and work with folks who are keen to quickly adopt new software, techniques and concepts.\n\nI am both an EU and Canadian citizen, with a preference towards roles in the EU.",
          "submission_date": "2025-05-07 21:10:42",
          "user_id": 8
        },
        {
          "id": 6,
          "goals": "I am looking for a Solutions Engineer or Lead Data Analytics role in the EU or Canada. I am also interested in Research or Sales opportunities in fun industries that could be a good fit for me.\n\nMy interests in life are economics, travel, history, sports, restaurants, bars, movies, books and TV shows. Any roles within these sectors would be a real bonus.  \n\nMoney is not the main driver behind my career. Roles of interest in exciting companies really gets me going. I am always looking to learn and work with folks who are keen to quickly adopt new software, techniques and concepts.\n\nI am both an EU and Canadian citizen, with a preference towards roles in the EU.",
          "submission_date": "2025-07-07 13:40:44",
          "user_id": 8
        }
      ]
    }
  }
}